//
//  BOJ-13706
//  백준 13706번 - 제곱근
//
//  Created by 손지영 on 2026/02/03
//  난이도: 브론즈1 | 소요시간: 15분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/13706
//

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 제곱근...
///     - l = 0, r = n, mid = (l + r) / 2
///     - 800자리...인데.. 그냥 곱하면 터지지 않나?
///     - if mid * mid > n -> if mid > n / mid
///             r = mid
///       else if mid < n / mid
///             l = mid + 1
///       else
///             print(mid)
/// 2. 자료구조
///     target Int
/// 3. 시간복잡도
///     O(800*logN) ~= logN
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================
func solution() {
    let target = Int64(readLine()!)!
    
    var l: Int64 = 1
    var r: Int64 = target
    
    while l < r {
        let m = (r + l) / 2
        
        if m > target / m {
            r = m - 1
        } else if m < target / m {
            l = m + 1
        } else {
            print(m)
            break
        }
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// 여전히 입력 범위를 벗어나기때문에 불가능.
