//
//  BOJ-1010
//  백준 1010번 - 다리 놓기
//
//  Created by 손지영 on 2026/02/03
//  난이도: 실버5 | 소요시간: 35분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1010
//

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - N개 만큼, 겹치지 않게
///     - 지을 수 있는 경우의 수 -> 조합 C(M, N)
///     1. dp[i][j]의 정의
///         - i: 오른쪽의 다리 선택, j: 왼쪽의 다리 선택
///     2. i, j의 진행방향
///         - i in 1...m, j in 1...n
///         - m의 첫번째 다리에서 n의 첫번째 다리부터 선택하기 시작
///     3. 점화식
///         - dp[i][j] = dp[i-1][j-1] + dp[i-1][j]
///         오른쪽 다리를 기준으로, 이전 다리의 건설 상태를 확인함
///         C(M, N) = C(M-1, N-1) + C(M-1, N) 조합 공식
///     4. 초기값
///         - dp[m][n] = 1
///         - dp[0][0] = 1
/// 2. 자료구조
///     - dp [[Int]]
/// 3. 시간복잡도
///     - O(N*M) 29*30 ~= 30^2 = 9e2
// ============================================
// 📌 주의사항
// ============================================
///
// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    for _ in 0..<t {
        let input = readLine()!.split(separator: " ").map { Int($0)! }
        let n = input[0]; let m = input[1]
        
        var dp = Array(repeating: Array(repeating: 0, count: n + 1), count: m + 1)
        
        dp[m][n] = 1
        
        for i in 0...m {
            dp[i][0] = 1
        }
        
        for i in 1...m {
            for j in 1...n {
                dp[i][j] = dp[i-1][j-1] + dp[i-1][j]
            }
        }
        
        print(dp[m][n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
