//
//  BOJ-13305
//  백준 13305번 - 주유소
//
//  Created by 손지영 on 2026/02/03
//  난이도: 실버3 | 소요시간: 30분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/13305
//

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 최소 비용.
///     - 채워야하는 최소(minG) = 거리의 합
///     - 그리디...
///     - 내가 지금 하는 선택히 최적해에 영향을 미치지 않아야한다.
///     - 항상 그 도시에서 다음 도시로 이동하는 값을 업데이트한다면?
/// 2. 자료구조
///     - d, g = [Int]
///     - minV Int
///     - cost Int
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================
func solution() {
    let n = Int(readLine()!)!
    let d = readLine()!.split(separator: " ").map { Int($0)! }
    let g = readLine()!.split(separator: " ").map { Int($0)! }
    
    var minV = g[0]
    var cost = 0
    
    for i in 0..<n-1 {
        minV = min(minV, g[i])
        cost += d[i] * minV
    }
    
    print(cost)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================

/*
swift BOJ-13305.swift <<EOF
4
2 3 1
5 2 4 1
EOF
 */
