//
//  BOJ-1541
//  백준 1541번 - 잃어버린 괄호
//
//  Created by 손지영 on 2026/02/03
//  난이도: 실버2 | 소요시간: 16분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1541
//

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 최소를 만드려면 음수가 무조건 묶여서 계산되어야함. 왜? 가장 작은수를 만들어야하니까.
///     - 동일한 연산자는 두번 연속 오지 않으므로, "-"로 구분해서 괄호를 만든다면?
///     - 입력 받아서 부호로 칸을 쪼갬
///     - -를 찾아서 그 앞뒤 인덱스 먼저 연산, 그 다음 앞 연산 후 더해줌.
/// 2. 자료구조
///     var sum Int
/// 3. 시간복잡도
///     O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================
func solution() {
    let input = readLine()!
    
    let s = input.split(separator: "-")
    
    var sum = s[0].split(separator: "+").map({ Int($0)! }).reduce(0) { $0 + $1 }
    
    for i in 1..<s.count {
        sum -= s[i].split(separator: "+").map({ Int($0)! }).reduce(0) { $0 + $1 }
        
    }
    
    print(sum)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
