//
//  BOJ-1788
//  백준 1788번 - 피보나치 수의 확장
//
//  Created by 손지영 on 2026/02/03
//  난이도: 실버3 | 소요시간: 22분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1788
//

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 음수일때?
///     - 일단 dp
///     - n = 0일때   F(0) = F(-1) + F(-2) -> 1 = 1 + F(-2) -> F(-2) = -1
///     - n = -1일때  F(-1) = F(-2) + F(-3) -> 1 = -1 + F(-3) -> F(-3) = 2 // 양수가 되어버림. 즉 무조건 음수는 아님
///     - n = 2일때   F(2) = F(1) + F(0) -> F(2) = 1 + 0 -> F(2) = 1       // 부호가 반전됨
///     - n = 3일때   F(3) = F(2) + F(1) -> F(3) = 1 + 1 -> F(2) = 2       // 음수일때와 같음
///     => 해볼수 있는 가정, 피보나치 수는 모두 동일하지만, n이 음수이면서 짝수이면 - 부호가 붙고 아니면 그대로 출력?
///     1. dp[i]의 의미
///         i = i-1 + i-2
///     2. i의 진행방향
///     3. 점화식
///         dp[i] = dp[i-1] + dp[i-2]
///     4. 초기값
///         dp[0] = 0, dp[1] = 1, dp[-1] = 1
/// 2. 자료구조
///     temp Int
///     dp[i] Int
/// 3. 시간복잡도
///     O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================
func solution() {
    let n = Int(readLine()!)!
    
    let temp = abs(n)
    
    if n == 0 {
        print(0)
    } else if n < 0 {
        print(temp % 2 == 0 ? -1 : 1)
    } else {
        print(1)
    }
    
    var dp = [0, 1]
    
    if temp >= 2 {
        for i in 2...temp {
            dp.append((dp[i-2] + dp[i-1]) % 1_000_000_000)
        }
        
    }
    
    print(dp[temp])
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
