
//: ## 그리디
/*:
 ---
 * 1. 그리디의 핵심 개념
 ---
 */
/// 정의
///     매 순간 가장 좋아 보이는 선택을 즉시 확정하며 문제를 해결하는 방식.
///         - 되돌아가지 않고
///         - 미래를 고려하지 않으며
///         - 로컬 최적 선택을 반복한다.
/// 핵심 질문
///     - 지금 이 선택이, 전체에서도 항상 최선이 되는가?
/*:
 ---
 * 2. 그리디가 성립하기 위한 두 가지 조건
 ---
 */
/// ① Greedy Choice Property (탐욕적 선택 속성)
///     - 어떤 최적해든, 첫 선택은 내가 한 탐욕적 선택과 같아도 된다
///     - 즉, 첫 수를 이렇게 둬도 전체 최적해가 깨지지 않는다
/// ② Optimal Substructure (최적 부분 구조)
///     - 문제의 최적해는 부분 문제의 최적해들로 구성된다
///  📌 이 두 조건이 증명 가능해야 그리디를 사용할 수 있다.
/*:
 ---
 * 3. 그리디가 자주 쓰이는 패턴
 ---
 */
/// ① 정렬 + 선택 : 기준 하나 정해서 정렬 후 앞에서 부터 고름
/// ② 최소/최대 우선 : 가장 작거나 가장 큰 것부터 처리
/// ③ 교환 논증 가능 : 선택을 바꿔도 해가 나빠지지 않음
/// ④ 결과가 누적됨 : 이전 선택을 되돌릴 필요 없음
/*:
 ---
 * 4. 그리디의 함정 ❗️
 ---
 */
/// 그리디가 실패하는 전형적 신호
///     - 선택이 미래 선택의 범위를 제한
///     - 조금 손해보면 나중에 더 이득인 구조
///     - 최적 부분 구조는 있지만 greedy choice가 성립 안함
///  📌 그래서 정당성 증명 없이는 절대 그리디라고 확정하면 안됨
/*:
 ---
 * 5. 그리디 정당성 증명의 표준 프레임
 ---
 */
/// 증명 템플릿
/// ① 그리디 선택 정의
///     - 우리가 매 단계에서 선택하는 기준을 명확히 한다.
///     예.
///     - 가장 빨리 끝나는 작업
///     - 가장 작은 비용
///     - 가장 큰 이드
/// ② 최적해 가정
///     - 어떤 최적해 x가 존재한다고 가정한다.
/// ③ 교환 논증
///     - x의 첫 선택이 그리디 선택과 다르다면
///       그 선택을 그리디 선택으로 바꿔도 전체 해의 품질이 나빠지지 않음을 보인다.
///    📌 핵심 문장 패턴:
///     - 두 선택을 교환해도 조건을 위반하지 않는다.
///     - 교체 후에도 여전히 유효한 해이다.
/// ④ 귀납적 결론
///     - 첫 선택이 같아졌으므로,
///     나머지 부분 문제에서도 같은 논리를 반복할 수 있다.
///     => 따라서 그리디 알고리즘은 항상 최적해를 만든다.
/*:
 ---
 * 6. 그리디의 이진 탐색
 */
/// 정렬: O(NlogN)
/// 한 번 스캔: O(N)
/// => O(NlogN)
/*:
 ---
 * 7. 예시로 연습해보는 그리디 (코드 없이)
 ---
 */
/// 📘 문제
///     여러 회의가 있고, 각 회의는 시작 시간과 종료 시간이 있다.
///     겹치지 않게 최대한 많은 회의를 선택하라.
///
///  "종료 시간에 가장 빠른 회의부터 선택"의 증명
///     1. 종료 시간이 가장 빠른 회의를 선택한다.
///     2. 어떤 최적해 x가 있다고 가정한다.
///     3. x의 첫 회의가 더 늦게 끝난다면
///         -> 가장 빨리끝나는 회의(그리디를 통해 선택한 회의)로 교체해도, 이후 선택 가능 회의 수는 줄지 않음
///         -> 그러니까 교체가 가능하므로 최적해가 변경되지 않으므로 안전한것으로 봄
///     4. 따라서 첫 선택은 안전
///     5. 나머지 구간에서도 동일
///  헷갈리는점
///     최적해: 문제에서 정의한 목표를 최대 혹은 최소로 만족하는 해.
///           이 문제에서는 더 많은 회의를 선택하는 해가 존재하지 않는 해.
///
/// 입력 예시
/// 11
/// 1 4
/// 3 5
/// 0 6
/// 5 7
/// 3 8
/// 5 9
/// 6 10
/// 8 11
/// 8 12
/// 2 13
/// 12 14
///
/// 출력 에시
/// 4

import Foundation

let input = """
11
1 4
3 5
0 6
5 7
3 8
5 9
6 10
8 11
8 12
2 13
12 14
"""

let lines = input.split(separator: "\n")

let n = Int(lines[0])!

var meetings = [(s: Int, e: Int)]()

for i in 1...n {
    let input = lines[i].split(separator: " ").map { Int($0)! }
    meetings.append((s: input[0], e: input[1]))
}

var lastMeetingEndTime = 0
var count = 0

meetings.sort {
    if $0.e == $1.e { return $0.s < $1.s }
    return $0.e < $1.e
}

for meeting in meetings {
    if meeting.s >= lastMeetingEndTime {
        count += 1
        lastMeetingEndTime = meeting.e
    }
}

print(count)
