//
//  BOJ-9461
//  백준 9461번 - 파도반 수열
//
//  Created by 손지영 on 2026/01/28
//  난이도: 실버3 | 소요시간: 42분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/9461
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     첫 삼각형, 변의 길이 1, P(N)은 정삼각형의 변의 길이.
///     P(1)부터 P(10)까지 1, 1, 1, 2, 2, 3, 4, 5, 7, 9의 의미:
///         처음 변의 길이가 1인 삼각형이 만들어짐.
///             -> 하단에 대칭 모양으로 변의 길이가 1인 삼각형이 만들어짐 (최대가 1)
///             -> 그 우측에 변의 길이가 1인 삼각형이 만들어짐 (최대 1)
///             -> 그 우측에 방금만든 변의 길이 1과 처음 만든 변의 길이 1이 같은 선상에 위치해 변의 길이가 2인 삼각형이 만들어짐 (최대 2)
///             -> 그 우측에 변의 길이가 2인 삼각형이 만들어짐 (최대 2)
///             -> 우측에 생성된 변의 길이 1의 삼각형과 방금 만들어진 변의 길이 2의 삼각형이 만나 변의 길이 3의 삼각형을 만들어냄 (최대 3)
///     1. dp[i] 정의
///         삼각형의 변의 길이.
///     2. dp 선택지
///         i-1 이전 길이에다가.. 뭘 더해야하는데..
///         그림으로 확장해서 찾아봤을 때, 11부터 i-5 크기를 더하는것으로 확인.
///     3. 점화식
///         dp[i] = dp[i-1] + dp[i-5]
///     4. 초기값
///         dp[1...10] = [1, 1, 1, 2, 2, 3, 4, 5, 7, 9]
///         - 편의상 작성된 값으로 실제 동작 안하는 오류 코드
/// 2. 자료구조
///     dp[N]
/// 3. 시간 복잡도
///     O(N) N은 100이하의 정수로 충분함
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    var dp = [0, 1, 1, 1, 2, 2, 3, 4, 5, 7, 9]
    
    for _ in 0..<t {
        let n = Int(readLine()!)!
        
        if n < dp.count {
            print(dp[n])
        } else {
            
            for i in dp.count...n {
                dp.append(dp[i-1] + dp[i-5])
            }
            print(dp[n])
        }
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
