//
//  BOJ-1788
//  백준 1788번 - 피보나치 수의 확장
//
//  Created by 손지영 on 2026/01/28
//  난이도: 실버3 | 소요시간: 62분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1788
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     양수일 때: n = n - 1 + n-2
///     F(2) = F(1) + F(0) = 1
///     F(3) = F(2) + F(1) = 1 + 1 = 2
///     F(4) = F(3) + F(2) = 2 + 1 = 3
///     F(-2) 같이 n값이 < -1 일때는 양수로 구해서 음수 붙여보기.
///     음수일 때는?
///     F(-1) = 1
///     F(-2) = F(0) - F(-1) = -1
///     F(-3) = F(-1) - F(-2) = 1 - (-1) = 2
///     F(-4) = F(-2) - F(-3) = -1 - 2 = -3
///     n이 홀수면 양수, 짝수면 음수??
///
///     어 음수여도 값이 같다 다만 음수인데 짝수면 음수가 됨????
///
///     절대값을 구해서 그 값을 절대값으로 나누므로 부호도 필요없나??
///
///     1. dp[i] 정의
///         피보나치 수
///     2. dp 선택지
///         i = i-1 + i-2인데 음수가 허용되어야함.
///         음수일때, (i + 2) - (i + 1) -> 필요없어짐
///     3. 점화식
///         dp[i] = dp[i-1] + dp[i-2] (양수일때)
///         dp[i] = dp[i+2] - dp[i+1] -> 필요없어짐
///     4. 초기값
///         dp[0] = 0, dp[1] = 1, dp[-1] = 1
/// 2. 자료구조
///     dp: dp[i]
/// 3. 시간 복잡도
///     O(N)?
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    var dp = [0, 1]
    
    let n = Int(readLine()!)!
    
    let k = abs(n)
    
    if n == 0 {
        print(0)
    } else if n < 0 {
        print(k % 2 == 0 ? -1 : 1)
    } else {
        print(1)
    }
    
    if k >= 2 {
        for i in 2...k {
            dp.append((dp[i-2] + dp[i-1]) % 1_000_000_000)
        }
    }
    
    print(dp[k])
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// 어렵다 음수계산.
/// 인덱스 배열을 벗어나니까 어렵다!
/// 양수, 음수, 0을 구분할 때 입력값인지 "계산값"인지 잘 확인할것.
/// 큰 수가 들어오면 OverFlow 발생 할 수 있다. 따라서 계산할 때 마다 절대값으로 나눠줄것.
