//
//  BOJ-2670
//  백준 2670번 - 연속부분최대곱
//
//  Created by 손지영 on 2026/01/29
//  난이도: 실버4 | 소요시간: 31분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2670
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     곱이 최대.. 한개 이상을 선택할 수 있음
///
///     1. dp[i]의 정의
///         이전까지 수들의 곱...
///     2. i의 진행방향
///         i는 이미 이전까지의 수들에 대한 곱이므로 선택 한 경우와 하지 않은 경우로 나누어 최대곱을 확인.
///         s [0, 1.1, 0.7, 1.3, 0.9, 1.4, 0.8, 0.7, 1.4]
///         dp[1] = 1.1
///         dp[2] = max(dp[1] * s[2], s[2]) = 0.77
///         하지만, 항상 dp의 last가 최대값이 아닐 수 있음..?
///     3. 점화식
///         dp[i] = max(dp[i-1] * s[i], s[i])
///     4. 초기값
///         dp[1] = s[1]
/// 2. 자료구조
///     dp [Double]
///     maxV Double
/// 3. 시간 복잡도
///     O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var s = Array(repeating: Double(0.0), count: n + 1)
    
    for i in 1...n {
        s[i] = Double(readLine()!)!
    }
    
    var maxV: Double = 0.0
    
    if n < 2 {
        print(String(format: "%.3f", s[n]))
    } else {
        var dp = Array(repeating: Double(0.0), count: n + 1)
        
        dp[1] = s[1]
        
        for i in 2...n {
            dp[i] = max(dp[i-1] * s[i], s[i])
            maxV = max(maxV, dp[i])
        }
        
        print(String(format: "%.3f",maxV))
    }
    
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// String format이 Foundation의 함수였다니
/// 초기값 설정을 빠트리지 말자.
