//
//  BOJ-9465
//  백준 9465번 - 스티커
//
//  Created by 손지영 on 2026/01/29
//  난이도: 실버1 | 소요시간: 35분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/9465
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     합이 최대. 인접한 스티커(상하/좌우)는 동시에 선택 불가, 선택하지 않을 수도 있음
///     1. dp[i][j]의 정의
///         i row j 스티커 위치, dp[i][j] 이 스티커를 선택했을 때 가질 수 있는 최대값
///     2. i, j의 진행방향
///         1번째 줄: s[i][1] + max(dp[2][i-1], dp[2][i-2])
///         2번째 줄: s[i][2] + max(dp[1][i-1], dp[1][i-2])
///     3. 점화식
///         row == 1: dp[1][i] = s[1][i] + max(dp[2][i-1], dp[2][i-2])
///         row == 2: dp[2][i] = s[2][i] + max(dp[1][i-1], dp[1][i-2])
///     4. 초기값
///         dp[1][1] = s[1][1]
///         dp[2][1] = s[2][1]
///         dp[1][2] = s[1][2] + dp[2][1]
///         dp[2][2] = s[2][2] + dp[1][1]
/// 2. 자료구조
///     dp[[Int]]
/// 3. 시간복잡도
///     O(N*2)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    for _ in 0..<t {
        let n = Int(readLine()!)!
        
        var s = Array(repeating: Array(repeating: 0, count: n + 1), count: 3)
        
        for i in 1...2 {
            var input = [0]
            input.append(contentsOf: readLine()!.split(separator: " ").map({Int($0)!}))
            s[i] = input
        }
        
        
        
        if n == 1 {
            print(max(s[1][1], s[2][1]))
        } else {
            var dp = Array(repeating: Array(repeating: 0, count: n + 1), count: 3)
            
            dp[1][1] = s[1][1]
            dp[2][1] = s[2][1]
            
            dp[1][2] = s[1][2] + dp[2][1]
            dp[2][2] = s[2][2] + dp[1][1]
            
            if n == 2 {
                print(max(dp[2][2], dp[1][2]))
            } else {
                for i in 3...n {
                    dp[1][i] = s[1][i] + max(dp[2][i-1], dp[2][i-2])
                    dp[2][i] = s[2][i] + max(dp[1][i-1], dp[1][i-2])
                    
                }
                
                print(max(dp[1][n], dp[2][n]))
            }
        }
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// 위치가 두번째인 스티커들의 초기값 ([2][1], [1][1])
///         dp[1][2] = s[1][2] + dp[2][1]
///         dp[2][2] = s[2][2] + dp[1][1]
