//
//  BOJ-1149
//  백준 1149번 - RGB거리
//
//  Created by 손지영 on 2026/01/29
//  난이도: 실버1 | 소요시간: 28분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1149
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     빨, 파, 초 중 하나로 칠해야함.
///     1번집은 2번 집의 색과 같지 않아야한다. N번집은 N-1번 집의 색과 같지 않아야한다.
///     i-1, i+1, 이웃된 값들과 색이 같지 않아야한다.
///     칠하는 비용의 최솟값
///     집마다 색깔별로 칠하는 비용이 다르네? 빨,초,파 순으로 입력됨
///     1. dp[i][color] 정의
///         i: 집, color: 선택한 색상
///     2. 진행 방향
///         i+1, j는 i-1이 선택하지 않은 값들 중 가장 저렴한 색상이어야함.
///     3. 점화식
///         dp[i][0] = s[i][0] + min(dp[i-1][1], dp[i-1][2])
///         dp[i][1] = s[i][1] + min(dp[i-1][0], dp[i-1][2])
///         dp[i][2] = s[i][2] + min(dp[i-1][0], dp[i-1][1])
///
///         minV = min(dp[i][0], min(dp[i][1], dp[i][2]))
///     4. 초기값
///         dp[1][0] = s[1][0]
///         dp[1][1] = s[1][1]
///         dp[1][2] = s[1][2]
/// 2. 자료구조
///     dp[[Int]]
/// 3. 시간 복잡도
///     O(N*3)

// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var s = Array(repeating: [Int](), count: n+1)
    
    for i in 1...n {
        s[i].append(contentsOf: readLine()!.split(separator: " ").map({ Int($0)! }))
    }
    
    var dp = Array(repeating: Array(repeating: 0, count: 3), count: n+1)
    
    dp[1][0] = s[1][0]
    dp[1][1] = s[1][1]
    dp[1][2] = s[1][2]
    
    for i in 2...n {
        dp[i][0] = s[i][0] + min(dp[i-1][1], dp[i-1][2])
        dp[i][1] = s[i][1] + min(dp[i-1][0], dp[i-1][2])
        dp[i][2] = s[i][2] + min(dp[i-1][0], dp[i-1][1])
    }
    
    print(min(dp[n][0], dp[n][1], dp[n][2]))
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
