//
//  BOJ-11660
//  백준 11660번 - 구간 합 구하기 5
//
//  Created by 손지영 on 2026/01/30
//  난이도: 실버1 | 소요시간: 80분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11660
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     1024*1024 사이즈. 연산은 최대 1e5
///     1. dp[y][x] 정의
///         (x1, y1)부터 (x2, y2)까지의 합
///     2. x, y의 전이
///         x + 1, y
///         x > n -> y+1
///
///         누적합 공부 후:
///         [a][b]
///         [c][d]
///         이 이차원 배열이 있다고 하자.
///
///         1, 1부터 2, 2까지 더한값을 알고 싶다.
///         dp[1][1] = a
///         dp[1][2] = a + b = map[1][2] + dp[i][k-1]
///         dp[2][1] = a + c = map[i-1][j] + map[2][1]
///         dp[2][2] = (a+b) + (a+c) - a = dp[i-1][j] + dp[i][j-1] -  dp[i-1][j-1] + map[i][j]
///
///         다만, dp[i-1][j-1]이 중복이 되므로 한번 빼줘야함.
///
///         dp[i][j] = dp[i-1][j] + dp[i][j-1] - dp[i-1][j-1] + map[i][j]
///     3. 점화식
///         y1
///         x < n: dp[y][x] = dp[y][x-1] + map[y][x]
///         x > n: continue
///         y2
///         x == x2: dp[y][x] = dp[y-1][x1] + map[y][x]
///         x < n: dp[y][x] = dp[y][x-1] + map[y][x]
///
///         누적합 공부 후:
///         단일 좌표가 아닌 이중 좌표에서는...
///         dp[i][j] = dp[i-1][j] + dp[i][j-1] - dp[i-1][j-1] + map[i][j]
///           sum = dp[y2][x2]
///                 - dp[y1-1][x2]
///                 - dp[y2][x1-1]
///                 + dp[y1-1][x1-1]
///     4. 초기값
///         dp[y1][x1] = map[y1][x1]
///
///         누적합 공부 후:
///         dp[0][*] = 0, dp[*][0] = 0
///
/// 2. 자료구조
///     dp[[Int]]
///     map[[Int]]
///     points[[Int]]
///
///     누적합 공부 후:
///     dp[[Int]]
///     map[[Int]]
/// 3. 시간 복잡도
///     O(N^2)
///
///     누적합 공부 후:
///     O(N^2): DP
///     O(M): 각 좌표 처리
///     => O(N^2 + M)
///
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let n = input[0]; let m = input[1]
    
    var map = Array(repeating: [Int](), count: n+1)
    
    for i in 1...n {
        var s = [0]
        s.append(contentsOf: readLine()!.split(separator: " ").map { Int($0)! })
        map[i] = s
    }
    
    var dp = Array(repeating: Array(repeating: 0, count: n+1), count: n+1)
    
    for y in 1...n {
        for x in 1...n {
            dp[y][x] = dp[y-1][x] + dp[y][x-1] - dp[y-1][x-1] + map[y][x]
        }
    }
    
    for i in 0..<m {
        let input = readLine()!.split(separator: " ").map { Int($0)! }
        let y1 = input[0]
        let x1 = input[1]
        let y2 = input[2]
        let x2 = input[3]
        
        print(dp[y2][x2] - dp[y1-1][x2] - dp[y2][x1-1] + dp[y1-1][x1-1])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// dp 정의했는데 안맞음. 구간합을 직접 구함. N이 1024개가 최대이기 때문에 시간 초과가 발생함.
///
/// (1,1) (1,2) (1,3) (1,4)
///   a     b     c     d
/// (2,1) (2,2) (2,3) (2,4)
///   e     f     g     h
/// (3,1) (3,2) (3,3) (3,4)
///   i     j     k     l
/// (4,1) (4,2) (4,3) (4,4)
///   m     n     o     p
///
/// 이런 행렬이 있을 때 (2, 2)와 (3, 4) 사이의 부분합을 구하면
/// f+g+h+j+k+l이 구해져야함.
///
/// dp를 사용하므로 (3, 4)까지의 누적합은 a+b+c+d+...+k+l = dp[3][4]
/// 불필요한 부분을 빼야함
///
/// 우선 첫번째줄은 몽땅 필요없으므로 모두 제거.
/// 첫번째 줄의 합은 dp[1][4]이므로 -dp[y1-1][x2]
/// => e+f+g+h+...+k+l
///
/// (2, 2)보다 왼쪽에서 시작하는것이 아직 남아있음
/// 그 두개의 합은 dp[3][1]이 가지고 있으므로 -dp[y2][x1-1]
/// => f+g+h+j+k+l - a
///
/// dp[3][1]에는 a의 값도 포함되어 있음 때문에 a는 하나 더 더해줘야함
/// +dp[y1-1][x1-1]
/// => f+g+h+j+k+l
