//
//  BOJ-15990
//  백준 15990번 - 1, 2, 3 더하기 5
//
//  Created by 손지영 on 2026/03/01
//  난이도: 실버1 | 소요시간: 35분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/15990
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 1, 2, 3으로 n을 구하는 방법, 단 같은 수 두 번 이상 연속은 안됨
///     - dp로 모든 값 우선 생성 후 접근
///     1. dp의 정의
///         각 수식이 종료되는 위치의 숫자(j)에 대한 경우의수([n][1...3])
///     2. i, j의 방향
///         i -> 수식의 합이 될 값
///         j -> 마지막이 i로 끝나는 수식
///         이 수식이 1로 끝나려면 -> 이전 수식이 2나 3으로 끝나야함
///         이 수식이 2로 끝나려면 -> 그 이전 (i-2) 수식이 1, 3으로 끝나야함
///         이 수식이 3으로 끝나려면 -> 그 전전(i-3) 수식이 1, 2로 끝나야함
///     3. dp[i][j]의 점화식
///
///     4. dp[i][j]의 초기값
///         dp[모든수][0] = 0
///         dp[1][1] = 1, dp[2][1] = 0, dp[3][1] = 1
///         dp[1][2] = 0, dp[2][2] = 1, dp[3][2] = 1
///         dp[1][3] = 0, dp[2][3] = 0, dp[3][3] = 1
/// 2. 자료구조
///     - dp [[Int]]
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    let divider = 1_000_000_009
    let max = 100_000
    var dp = Array(repeating: Array(repeating: 0, count: 4), count: max + 1)
    for i in 0...max {
        dp[i][0] = 0 % divider
    }
    dp[1] = [0, 1, 0, 0]
    dp[2] = [0, 0, 1, 0]
    dp[3] = [0, 1, 1, 1]
    
    for i in 4...max {
        dp[i][1] = (dp[i-1][2] + dp[i-1][3]) % divider
        dp[i][2] = (dp[i-2][1] + dp[i-2][3]) % divider
        dp[i][3] = (dp[i-3][1] + dp[i-3][2]) % divider
    }
    
    for _ in 0..<t {
        let n = Int(readLine()!)!
        print(dp[n][1...3].reduce(0, +) % divider)
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
