//
//  BOJ-4375
//  백준 4375번 - 1
//
//  Created by 손지영 on 2026/03/01
//  난이도: 실버3 | 소요시간: 33분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/4375
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 2와 5로 나누어 떨어지지 않는 정수 n
///     - 각 자리수가 모두 1로만 이루어진 n의 배수...
///     - 각 자리수가 1이려면 (이전 값 * 10 + 1)
///     - 자리수를 늘려가며 나머지가 0이 되면 종료 (그게 n의 최소 배수)
/// 2. 자료구조
///     - rem Int
///     - length Int
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    while let input = readLine() {
        let n = Int(input)!
        
        var rem = 0
        var length = 0
        
        while true {
            rem = (rem * 10 + 1) % n
            length += 1
            if rem == 0 { break }
        }
        
        print(length)
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
