//
//  BOJ-11055
//  백준 11055번 - 가장 큰 증가하는 부분 수열
//
//  Created by 손지영 on 2026/03/01
//  난이도: 실버2 | 소요시간: 16분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11055
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 증가하는 부분 수열에서 합이 가장 큰것.
///     - 크기는 최대 1000, dfs로 찾으면 2^N = 시간초과 가능성
///     - DP 접근이 필요해보임
///     1. dp[i]의 정의
///         - arr[i]에서 끝나는 수열의 최대 합
///     2. i의 진행방향
///         - 0..<n
///         - 내가 포함된 수열의 최대값과 이전까지 택한 수열과 + arr[i] 중 큰값
///     3. dp의 점화식
///         for i in 0..<n
///             for j in 0..<i
///                 if arr[j] >= arr[i] { continue }
///                 dp[i] = max(dp[i], dp[j] + arr[i])
///     4. dp의 초기값
///         - dp[i] = arr[i]
/// 2. 자료구조
///     - dp [Int]
/// 3. 시간복잡도
///     - O(N^2)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let arr = readLine()!.split(separator: " ").map { Int($0)! }
    
    var dp = Array(repeating: 0, count: n)
    
    for i in 0..<n {
        dp[i] = arr[i]
    }
    
    for i in 0..<n {
        for j in 0..<i {
            if arr[j] >= arr[i] { continue }
            dp[i] = max(dp[i], dp[j] + arr[i])
        }
    }
    
    print(dp.max()!)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
