//
//  BOJ-11404
//  백준 11404번 - 플로이드
//
//  Created by 손지영 on 2026/02/02
//  난이도: 골드4 | 소요시간: - | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11404
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     모든 도시의 쌍에 대해, 이동 비용의 최솟값 -> 플로이드
///     rs [[Int]] 모든 도시에 대한 비용을 저장
///     처음 동일 도시 간선(A-A)에 대해 비용 0으로 초기화
///     간선 수만큼 입력받아 rs[출발][도착] = min(rs[출발][도착], 입력받은 비용)
/// 2. 자료구조
///     rs [[Int]]
/// 3. 시간복잡도
// ============================================
// 📌 주의사항
// ============================================
//
// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let m = Int(readLine()!)!
    
    var rs = Array(repeating: Array(repeating: Int.max, count: n+1), count: n+1)
    
    for i in 1...n {
        rs[i][i] = 0
    }
    
    for _ in 0..<m {
        let input = readLine()!.split(separator: " ").map { Int($0)! }
        
        let a = input[0]
        let b = input[1]
        let c = input[2]
        
        rs[a][b] = min(rs[a][b], c) // 여러개 간선 중 가장 최소값으로 계속 업데이트
    }
    
    for k in 1...n { // 거치는 노드
        for j in 1...n { // 시작 노드
            for i in 1...n { // 도착 노드
                if rs[j][k] != Int.max && rs[k][i] != Int.max { // 이 조건을 충족하지 않는다면 이동 불가능한 노드로 취급
                    // 시작에서 끝으로 가는 비용이, 시작에서 k로 거쳤다가 k에서 i로 가는 비용보다 크면
                    if rs[j][i] > rs[j][k] + rs[k][i] {
                        // 거처가는 비용이 더 저렴하다는 의미므로 해당 값으로 변경
                        rs[j][i] = rs[j][k] + rs[k][i]
                    }
                }
            }
        }
    }
    
    for i in 1...n {
        print((1...n).map { rs[i][$0] == Int.max ? "0" : String(rs[i][$0]) }.joined(separator: " "))
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
//

/*
swift BOJ-11404.swift <<EOF
5
14
1 2 2
1 3 3
1 4 1
1 5 10
2 4 2
3 4 1
3 5 1
4 5 3
3 5 10
3 1 8
1 4 2
5 1 7
3 4 2
5 2 4
EOF
 */
