//
//  BOJ-1476
//  백준 1476번 - 날짜 계산
//
//  Created by 손지영 on 2026/02/11
//  난이도: 실버5 | 소요시간: 40분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1476
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     지구 e, 태양 s, 달 m
///     1년이 지날 때 마다 모두 1씩 증가 -> 범위가 넘어가는 수가 있으면 1이 됨
///     E <= 15, S <= 28, M <=19
///
///     n년을 표기할 때, n n n 으로 표기하지만 범위가 넘어가면 1로 표기 = 몇번을 반복할 수 있음
///     x % 15, x % 28, x % 19의 값이 모두 일치할때..의 연도를 구하면 됨
///     E가 1이 주어지면, 15 * e + 1
///     S가 2가 주어지면, 28 * s + 2
///     M이 3이 주어지면, 19 * m + 3
/// 2. 자료구조
/// 3. 시간복잡도
///     - O(1)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    
    let e = input[0]
    let s = input[1]
    let m = input[2]
    
    let maxV = (e: 15, s: 28, m: 19)
    
    var year = (e: 1, s: 1, m: 1)
    
    var now = 1
    
    while true {
        if year.e == e && year.s == s && year.m == m {
            print(now)
            break
        }
        
        now += 1
        
        year.e = year.e % maxV.e + 1
        year.s = year.s % maxV.s + 1
        year.m = year.m % maxV.m + 1
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
/// 핵심 아이디어를 구현하는 방법.......
