//
//  BOJ-2225
//  백준 2225번 - 합분해
//
//  Created by 손지영 on 2026/02/13
//  난이도: 골드5 | 소요시간: 33분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2225
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 합이 N이 되는 "경우의 수"
///     - 순서가 변경되면 다른 경우, 한 개의 수 여러번도 가능
///     - 답은 1_000_000_000으로 나눈 나머지
///     - dp로 누적시키면서 풀어야할듯.
///     1. dp 정의
///         dp[k][n] = 정수 n을 k개의 수 합으로 만드는 경우의 수
///     2. 초기값
///         dp[1][n] = 1
///         dp[k][0] = 1
///     3. 점화식
///         dp[k][n] = dp[k-1][n] + dp[k][n-1]
/// 2. 자료구조
///     - dp [[Int]]
/// 3. 시간복잡도
///     - O(K * N)
///      : 2e2 * 2e2 = 4e4
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let n = input[0]; let k = input[1]
    
    let mod = 1_000_000_000
    var dp = Array(repeating: Array(repeating: 0, count: n + 1), count: k + 1)
    
    for i in 1...k { dp[i][0] = 1 }
    for j in 0...n { dp[1][j] = 1 }
    
    if k >= 2 {
        for i in 2...k {
            for j in 1...n {
                dp[i][j] = (dp[i-1][j] + dp[i][j-1]) % mod
            }
        }
    }
    print(dp[k][n])
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================

