//
//  BOJ-15988
//  백준 15988번 - 1, 2, 3 더하기 3
//
//  Created by 손지영 on 2026/02/11
//  난이도: 실버2 | 소요시간: 12분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/15988
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 방법의 "수" 1, 2, 3 중 중복을 허용하되 정수 n이 되게하는 수열 찾기
///     - dfs...가 되려나? dfs로 하려면.. O(N^3).. 범위 초과 될듯
///     - dp..
///     - dp[n] = dp[n-1]+dp[n-2]+dp[n-3]
///     - dp[1] = 1, dp[2] = 2, dp[3] = 4, dp[4] = 7
/// 2. 자료구조
///     - dp[N]
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    let mod = 1_000_000_009
    let max = 1_000_000
    var dp = Array(repeating: 0, count: max + 1)
    
    dp[1] = 1 % mod
    dp[2] = 2 % mod
    dp[3] = 4 % mod
    
    for i in 4...max {
        dp[i] = (dp[i-3] + dp[i-2] + dp[i-1]) % mod
    }
    
    for _ in 0..<t {
        let n = Int(readLine()!)!
        print(dp[n])
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
/// 작은수를 여러번 반복하는것 보다 큰 수를 한번 처리하는게 더 나은 방법일 때가 있다.
