//
//  BOJ-1037
//  백준 1037번 - 약수
//
//  Created by 손지영 on 2026/02/12
//  난이도: 브론즈1 | 소요시간: 11분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1037
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - N의 약수 : A*X = N, A != 1 && A != N
///     - 주어진 값들 중 max와 min을 찾음
///     - max * min
/// 2. 자료구조
/// 3. 시간복잡도
///     - O(NlogN)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let s = readLine()!.split(separator: " ").map { Int($0)! }
    
    let sorted = s.sorted()
    let maxV = sorted.last!
    if n == 1 {
        print(maxV * maxV)
    } else {
        let minV = sorted[0]
        print(maxV * minV)
    }
    
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
