//
//  BOJ-6064
//  백준 6064번 - 카잉 달력
//
//  Created by 손지영 on 2026/02/13
//  난이도: 실버1 | 소요시간: 20분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/6064
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - nx = (x + 1) % m, ny = (y + 1) % n
///     - 입력한 x, y는 몇번째 해인지.
///     - 표현되는 해가 없음은 어떻게 찾을것인가?
///     - 최대 수 : m * n
///     - x+m을 시작으로 m만큼 증가할 때, n으로 나눈 나머지가 y이면 그 해가 정답
///     - 못찾으면 -1 출력
/// 2. 자료구조
///
/// 3. 시간복잡도
///     - O(n) = 4e3 * 4e3 = 1.6e7
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    for _ in 0..<t {
        let input = readLine()!.split(separator: " ").map { Int($0)! }
        let m = input[0]; let n = input[1]
        let x = input[2]; let y = input[3]
        
        let max = m * n
        
        var year = x
        var find = false
        
        while year <= max {
            if year % n == (y % n) {
                find = true
                break
            } else {
                year += m
            }
        }
        
        print(find ? year : -1)
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================

