//
//  BOJ-33912
//  백준 33912번 - N거리 건너기
//
//  Created by 손지영 on 2026/02/10
//  난이도: 실버2 | 소요시간: 50분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/33912
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - N개의 인도, 두 인도를 연결하는 N개의 횡단보도
///     - N은 N과 1, i는 i와 i+1을 연결
///     - 1부터 i -> i+1 순으로 초록불 켜짐
///     - 마지막 신호등일 경우 다시 1이 켜짐
///     - 시계/반시계 중 더 빠른경로
///     - for i in 0...이동할 위치
///         if p[i] >= cw { cw = p[i] }
///         else { cw = p[i] + n } -> n: 다음 주기까지 기다림
///     - for i in stride(from: N, to: 이동할 위치, by: -1)
///         if p[i] >= ccw { ccw = p[i] }
///         else { ccw = p[i] + n }
/// 2. 자료구조
///     - a, p: [Int]
/// 3. 시간복잡도
///     - O(N+N) ~= O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let n = input[0]; let target = input[1]
    
    let a = readLine()!.split(separator: " ").map { Int($0)! }
    var p = Array(repeating: 0, count: n + 1)
    
    for (i, c) in a.enumerated() {
        p[c] = i
    }
    
    var tCW = 0
    var tCCW = 0
    
    for i in 1..<target {
        let r = tCW % n               // 현재 주기에서의 시각(0..n-1)
        let wait = (p[i] - r + n) % n // 다음 초록까지 기다리는 시간
        tCW += wait
    }
    
    for i in stride(from: n, through: target, by: -1) {
        let r = tCCW % n              // 현재 주기에서의 시각(0..n-1)
        let wait = (p[i] - r + n) % n // 다음 초록까지 기다리는 시간
        tCCW += wait
    }
    
    if tCW > tCCW { print("CCW") }
    else if tCW < tCCW { print("CW") }
    else { print("EQ") }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
/// p: 각 횡단보도 별 초록색으로 변경되는 시각
/// 예시 입력: 4 3 / 1 2 3 4
/// - A = [1,2,3,4], p[1]=0, p[2]=1, p[3]=2, p[4]=3
/// - 시계방향(1->2->3): 1번은 t=0에 바로 건넘, 2번은 t=1에 건넘 -> 최종 tCW=1
/// - 반시계방향(1->4->3): 4번은 t=3에 건넘, 3번은 t=2이지만 현재 t=3이므로 다음 주기 t=2+4=6 -> 최종 tCCW=6
/// - 결과: CW
/// - 시계방향 r/wait 변화
///     - 1번: r=0, wait=(0-0+4)%4=0 -> t=0
///     - 2번: r=0, wait=(1-0+4)%4=1 -> t=1
/// - 반시계방향 r/wait 변화
///     - 4번: r=0, wait=(3-0+4)%4=3 -> t=3
///     - 3번: r=3, wait=(2-3+4)%4=3 -> t=6
