//
//  BOJ-17213
//  백준 17213번 - 과일 서리
//
//  Created by 손지영 on 2026/02/10
//  난이도: 실버2 | 소요시간: 22분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/17213
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - N가지 종류 중 M개 선택 "경우의수"
///     - C(M-1, N-1): 이미 한개씩 고르는 경우가 있으므로
///     - dp[n][m], n개를 고르는 경우의 수
///     - dp[n][0] = 1, dp[n][n] = 1 // 아무것도 안고르고, 모두 고르는 1가지
///     - dp[n][m] = dp[n-1][m-1] + dp[n-1][m]
/// 2. 자료구조
///     - dp[n][m]
/// 3. 시간복잡도
///     - O(N*M)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let m = Int(readLine()!)!
    
    var dp = Array(repeating: Array(repeating: 0, count: n + 1), count: m + 1)
    
    for i in 0...m {
        dp[i][0] = 1
    }
    
    for i in 1...m {
        for j in stride(from: min(n, i), through: 1, by: -1) {
            dp[i][j] = dp[i-1][j-1] + dp[i-1][j]
        }
    }
    
    print(dp[m-1][n-1])
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
