//
//  BOJ-17425
//  백준 17425번 - 약수의 합
//
//  Created by 손지영 on 2026/02/13
//  난이도: 골드4 | 소요시간: 30분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/17425
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - C = A/B를 만족하는 모든 값
///     - 약수의 합: f(A)
///     - ...x의 모든 자연수 y에 대한 약수를 더한 값 = g(x)
///     - 이전 값을 모두 사용해야하므로 dp가 좋을듯
///     - 약수의 합은 어떻게 구하냐.
///         for b in 1...B (입력받은 값들까지의 모든 자연수 확인)
///             A(입력받은 자연수) % b == 0
///                 sum += b
///     1. 점화식
///         - dp[i] = (i의 약수의 합) + dp[i-1]
///     2. 초기값
///         - dp[1] = 1
///         - dp[2] = 4
/// 2. 자료구조
///     - g [Int] 약수의 합
///     - dp [Int] 누적합
/// 3. 시간복잡도
///     - O(N log N): 약수합
///     - O(N) : dp
///     : logN = log10^6 ~= 20
///     : NlogN = 1e6 * 20 = 2e7
///     : NlogN + N = 2e7 + 1e6 = 2e7
///
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    let maxV = 1_000_000
    var g = Array(repeating: Int64(0), count: maxV + 1)
    
    for b in 1...maxV {
        for a in stride(from: b, through: maxV, by: b) {
            g[a] += Int64(b)
        }
    }
    
    var dp = Array(repeating: Int64(0), count: maxV + 1)
    dp[1] = g[1]
    for i in 2...maxV {
        dp[i] = dp[i - 1] + g[i]
    }
    
    for _ in 0..<t {
        let x = Int(readLine()!)!
        print(dp[x])
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================

