//
//  BOJ-2231
//  백준 2231번 - 분해합
//
//  Created by 손지영 on 2026/01/11 21:24
//  난이도: 브론즈2 | 소요시간: 30분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2231
//

import Foundation


// ============================================
// 핵심 아이디어
// ============================================
// 1. 사용할 자료구조/알고리즘:
//    - 자릿수: [Int]
//    - 생성자: Int
//
// 2. 시간복잡도:
//    - 자리수: d = 7
//    - 순회 범위: 9 * d번 = 9*7 = 63
//    - O(9d * d) ~= O(d^2) = 9*49 = 441
//
// 3. 접근 방법:
//    - 입력한 정수의 자릿수 구하기 let cnt: Int
//    - 각 자리수는 9가 최대이므로 (분해합-(자릿수*9))가 생성자가 될 수 있는 최소값이 될것 var min: Int
//    - (N - N의자리수) * 9 부터 찾기 시작

// ============================================
// 주의사항
// ============================================
// -

// ============================================
// 구현
// ============================================


func solution() {
    // 구현 시작
    let input = readLine()!
    
    let n = Int(input)!
    let cnt = input.count
    let min = n - (9 * cnt)
    var rs = 0
    
    for i in min..<n {
        var num = i
        var sum = 0
        while num > 0 {
            sum += num % 10
            num /= 10
        }
        
        if (i + sum) == n {
            rs = i
            break
        }
    }
    
    print(rs)
}

solution()

// ============================================
// 어려운점
// ============================================
// 1. 분해합에 대한 이해도가 떨어짐
// 2. 자리수를 어떻게 접근할것인가
// 3. 최소값에 집착하지 말것!!!
