//
//  BOJ-1541
//  백준 1541번 - 잃어버린 괄호
//
//  Created by 손지영 on 2026/01/25
//  난이도: 실버2 | 소요시간: 40분 | 상태: ✅

//  링크: https://www.acmicpc.net/problem/1541
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 연산자는 한번에 하나만. 연속해서는 안나타남.
//      - 수는 0으로 시작할 수 없다 -> 그냥 정수로 인식
//      - 연산이 모두 같으면, 괄호 필요없이 모두 연산하면 된다.
//      - 연산이 다르면, 비교해야하는데...
//      - -를 진행할 때 뒤 수를 가장 크게 만들어야함. +는 그런거 없음
//      - -가 있으면, 내가 지금 -야. 계산할 연산이. 그럼 뒤에 + 연산 우선 계산함.
//          다시 -를 만날때 까지 덧셈을 다 함.
//          앞의 - 하고, 이걸 계속 반복함.
//      - "55-50+40"을 입력받았을 때, 연산자 -혹은 +로 쪼갬? 그럼 입력값 분석에도 O(N)이 발생하네
//      - 첫번째 기준이 필요하므로 -로 나눈 첫번째 연산 수행
//      - String으로 받고, for i in 1..<연산배열.cnt
//          연산배열은 - 기준으로 나누어졌기 때문에.. +연산을 기준으로 처리하고.. - 해줌..?
// 2. 자료구조
//      - var s = [String] // -기준으로 나눈 연산들
//      - var n = Int // 연산 결과값
// 3. 시간 복잡도
//      - O(N).

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!
    let s = input.split(separator: "-")
    
    var n = s[0].sum()
    
    for i in 1..<s.count {
        n -= s[i].sum()
    }
    
    print(n)
}

solution()

extension Substring {
    func sum() -> Int {
        return self.split(separator: "+")
            .map { Int($0)! }
            .reduce(0) { $0 + $1 }
    }
}

// ============================================
// ❌ 헷갈린점
// ============================================
//
// 이전 연산을 어떻게 처리하느냐.
