//
//  BOJ-11047
//  백준 11047번 - 동전 0
//
//  Created by 손지영 on 2026/01/24 17:30
//  난이도: 실버4 | 소요시간: 20분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11047
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 합 K를 만드는 동전의 최소 개수
//      - 먼저 생각해볼것
//      - 최적해를 가정했을 때, 첫번째 선택을 했을 때 최적해가 깨지지 않음을 증명해야함
//          - 동전을 선택할 수 있는 개수는 K / 동전값, 나머지는 K % 동전값
//          - 먼저 K / 동전값이 가장 작은걸 선택 -> 최소 개수를 구해야하므로
//              -> 수열 전체를 탐색하지 않고, N부터 -1로 내려오며 큰값부터 계산하면 빠름
//          - 다시 K % 동전값으로 위의 로직 반복. K % 동전값이 0이될때 반복 종료
// 2. 자료구조
//      - 동전 : [Int]
//      - 선택 개수, 남은 금액 : Int
// 3. 시간 복잡도
//      - 탐색 O(N)

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let n = input[0]; var k = input[1];
    
    var coins = [Int]()
    
    for _ in 0..<n {
        coins.append(Int(readLine()!)!)
    }
    
    var count = 0
    
    for i in stride(from: n - 1, through: 0, by: -1) {
        if k / coins[i] > 0 {
            count += k / coins[i]
            k %= coins[i]
        }
    }
    
    print(count)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
//
// 언제까지 헷갈릴래 to, through




