//
//  BOJ-13706
//  백준 13706번 - 제곱근
//
//  Created by 손지영 on 2026/01/21
//  난이도: 브론즈1 | 소요시간: 30분 | 상태: ⚠️
//  링크: https://www.acmicpc.net/problem/13706
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심아이디어:
//      - 1부터 입력받은 N까지 탐색해서 제곱근이 있는지 확인
//      - left: 1, right: N
//      - left가 right보다 작거나 같을때 까지, mid값이 left + (right - left) / 2로 접근해서 찾은 값을 제곱했을 때 n이 나와야함
//          - n보다 작으면 right를 mid - 1
//          - n보다 크면 left를 mid + 1
// 2. 자료구조:
//      - left, right: 탐색 범위
//      - mid: 중위인덱스
//      - value: Int? 찾은 값
// 3. 시간복잡도:
//      - O(logN): 수열 만드는거?

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var left = 1
    var right = n
    
    var num = 0
    
    while left <= right {
        var mid = left + (right - left) / 2
        
        if (mid * mid) == n {
            num = mid
            break
        } else if mid < n {
            left = mid + 1
        } else {
            right = mid - 1
        }
    }
    
    print(num)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// 백준에서는 런타임 오류난다. 입력값이 매우 커서 처리 못한다는듯.
// 콘솔창을 통해 안전한 값들을 입력하면 정상동작한다. 큰값은 나중에 처리해보는것으로.
