//
//  BOJ-1463
//  백준 1463번 - 1로 만들기
//
//  Created by 손지영 on 2026/01/16 12:55
//  난이도: 실버3 | 소요시간: 70분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1463
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 모든 수에 대해서 확인.
//          => x가 5이면 1, 2, 3, 4, 5 중에 4, 5 확인. 1은 목표값, 2와 3은 주어진 연산 1회로 바로 찾을 수 있기 때문에
//      - 숫자를 체크할 때 마다 3개의 연산을 조건이 맞으면 무조건 돌려봄.
//          => 연산 이후 최소 횟수로 업데이트
//      - 최적의 답을 찾는것 ("적절히" 연산을 사용)
//      - 나눌수 있으면 해당 연산 시작
//      - 값이 주어졌을 때 우선 해당 연산이 가능한지 확인
//          - 가능하다면, 사용한 경우와 아닌 경우로 나누어서 확인
//          - 이 이전값을 어떻게 담을것인가 (경우의수에 대한 이전 값을 들고있어야하나?)
// 2. 자료구조
//      - dp: [Int] // 최소 연산 횟수 선택
// 3. 시간복잡도
//      - O(3*N) 점화식 3개이므로? ~= O(N). N = 1e6이니까 안전함

// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let x = Int(readLine()!)!
    
    if x == 1 {
        print(0)
        return
    } else if x == 2 {
        print(1)
        return
    } else if x == 3 {
        print(1)
        return
    }
    
    var dp = Array(repeating: 0, count: x + 1)
    
    dp[1] = 0
    dp[2] = 1
    dp[3] = 1
    
    for i in 4...x {
        dp[i] = dp[i-1] + 1
        if i % 3 == 0 { dp[i] = min(dp[i], dp[i/3] + 1) }
        if i % 2 == 0 { dp[i] = min(dp[i], dp[i/2] + 1) }
    }
    
    print(dp[x])
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// dp 설정.. 점화식은 항상 헷갈린다.
// i는 현재 숫자, dp[i]는 1로 만드는데 필요한 최소 연산 횟수
// 어디까지 기본값으로 제공할것인가.
