//
//  BOJ-9095
//  백준 9095번 - 1, 2, 3 더하기 (실버3)
//
//  Created by 손지영 on 2026/01/16 20:55
//  난이도: 실버3 | 소요시간: 45분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/9095
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 기본값 3까지 구한다. dp[1] = 1, dp[2] = 2, dp[3] = 4
//      - 이미 해당 숫자를 만들 수 있는 최적의 방법의수.
//      - 보다 큰 숫자들은 해당 조합들을 사용해서 만들어 나가면 됨.
//      - dp는 입력받는 수보다 하나 많이 배열을 만들어서 인덱스 그대로 접근할 수 있게 하고
//      - dp 배열을 for문에서 사용할건데, 4이상 n+1미만까지 조합 확인해나가기.
//      - 1과 2와 3을 사용하기 때문에 i-1, i-2, i-3의 조합을 찾음. 이걸 모두 더하면 해당 값의 방법의수
//      - dp[n]이 n을 구하는 방법의 수
//      - dp는 입력받은 값들 중 가장 큰 값으로 만들어 놓는다. (어차피 모든 케이스가 동일하므로)
// 2. 자료구조
//      - dp [Int]
// 3. 시간복잡도
//      - dp 계산: O(N)
//      - 출력: O(t)

// ============================================
// 📌 주의사항
// ============================================


// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    var testCase = [Int]()
    var maxV = 0
    
    for _ in 0..<t {
        let n = Int(readLine()!)!
        testCase.append(n)
        maxV = max(n, maxV)
    }
    
    var dp = Array(repeating: 0, count: maxV + 1)
    
    dp[1] = 1
    dp[2] = 2
    dp[3] = 4
    
    for i in 4..<maxV + 1 {
        dp[i] = dp[i-3] + dp[i-2] + dp[i-1]
    }
    
    for n in testCase {
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// 중복 허용에 낚이지 말자!
