//
//  BOJ-11726
//  백준 11726번 - 2×n 타일링 (실버3)
//
//  Created by 손지영 on 2026/01/16
//  난이도: 실버3 | 소요시간: 10분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11726
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 1x2, 2x1 타일로 채워나가기.
//      - dp, N+1만큼 만들기. 인덱스 값을 채워나가는 방법의 수 찾기.
//      - 점화식: 2x1 = 1, 2x2 = 2
//          => i = i-2, i-2
//          => for i in 3..<n+1
//          => n이 1, 2이면 dp 없이 바로 출력
//      - dp[n] % 10007 출력
// 2. 자료구조
//      - dp: [Int]
// 3. 시간복잡도
//      - O(N) : dp 정렬

// ============================================
// 📌 주의사항
// ============================================


// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var dp = Array(repeating: 0, count: n+1)
    
    if n == 0 {
        print(0)
    }
    else if n == 1 {
        print(1 % 10007)
    } else if n == 2 {
        print(2 % 10007)
    } else {
        dp[1] = 1
        dp[2] = 2
        
        for i in 3..<n+1 {
            dp[i] = (dp[i-2] + dp[i-1]) % 10007
        }
        
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// n이 1000일경우 런타임 에러 방지 코드가 필요하다.
