//
//  BOJ-2579
//  백준 2579번 - 계단 오르기 (실버3)
//
//  Created by 손지영 on 2026/01/16 23:30
//  난이도: 실버3 | 소요시간: 40분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2579
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심아이디어
//      - 시작점은 밟는걸로 취급 안하고, 마지막 계단은 무조건 밟아야함.
//      - 계단은 최대 2개까지 연속해서 올라갈 수 있음. 3개부터 안됨!
//      - 마지막 계단은 "무조건"밟으므로 역순으로 dp 정렬
//      - for i in 4...n
//          - dp[i] = 두번째, 세번째 + 이전꺼 중에 max + 지금꺼
//      - dp[n] 출력.
// 2. 자료구조
//      - dp: [Int]
//      - score: [Int] // 계단 값
// 3. 시간복잡도
//      - dp 정렬: O(N)

// ============================================
// 📌 주의사항
// ============================================


// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var dp = Array(repeating: 0, count: n+1)
    var score =  Array(repeating: 0, count: n+1)
    
    for i in 1..<n+1 {
        let value = Int(readLine()!)!
        score[i] = value
    }
    
    dp[1] = score[1]
    if n >= 2 {
        dp[2] = score[1] + score[2]
    }
    if n >= 3 {
        dp[3] = max(score[1] + score[3], score[2] + score[3])
    }
    
    if n >= 4 {
        for i in 4...n {
            dp[i] = max(dp[i-2], dp[i-3] + score[i-1]) + score[i]
        }
    }
    
    print(dp[n])
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// 무조건 배열 하나로 되는건 아니다.
