//
//  BOJ-1931
//  백준 1931번 - 회의실 배정
//
//  Created by 손지영 on 2026/01/25
//  난이도: 실버2 | 소요시간: 22분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1931
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 겹치지 않게 사용할 수 있는 회의의 최대 개수
//      - 다음 회의는 이전 회의의 끝나는 시점에 초점맞춰서 찾아야한다.
//      - 종료시간이 빠른것 부터 확인 필요
//          - 종료 시간으로 정렬하되, 동일하게 끝나면 시작시간이 작은것부터 정렬.
//      - 직전 진행한 회의의 종료 시간 값을 기준으로 이후 미팅을 선택할 수 있는지 없는지를 체크.
// 2. 자료구조
//      - meeting = [(s: Int, e: Int)]
//      - n: Int, count: Int, lastMeeting: Int
// 3. 시간 복잡도
//      - O(logN) : 오름차순 정렬
//      - O(N) : 그리디, 1회 순회.
//          = O(NlogN), N이 1e5 log₂10^5 ~= 2^20 logN ~= 20
//         ~= O(1e5 * 20)

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var m = [(s: Int, e: Int)]()
    
    for _ in 0..<n {
        let input = readLine()!.split(separator: " ").map { Int($0)! }
        m.append((s: input[0], e: input[1]))
    }
    
    var lastMeeting = 0
    var count = 0
    
    m.sort(by: {
        if $0.e == $1.e { return $0.s < $1.s }
        return $0.e < $1.e
    })
    
    for meeting in m {
        if meeting.s >= lastMeeting {
            lastMeeting = meeting.e
            count += 1
        }
    }
    
    print(count)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// 누적합이면 안됨. 왜냐: 비교는 “다음 회의의 시작 시간 > 마지막으로 선택한 회의의 종료 시각”이어야 하므로
// sorted는 원본 안건들임. sort가 원번 건들임



