//
//  BOJ-13305
//  백준 13305번 - 주유소
//
//  Created by 손지영 on 2026/01/25
//  23분 소요 17점,
//  + 20분 소요 100점
//  난이도: 실버3 | 소요시간: 43분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/13305
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 이동의 최소 비용.
//      - 입력받는 값이 도시의 개수 N, 도시간 간선의 길이 [Int], 도시별 주유소 가격 [Int]
//      - 모든 도시 탐방에 필요한 합을 가지고 최소 주유 비용을 구해야함.
//      - 이미.. 도시의 순서가 있음 이 순서를 무시할 수 없음
//      - 첫번째 도시에서는 무조건 다음 도시까지의 주유가 필요.
//          - 만약 첫번째 도시의 주유값이 최소값이 아니면 다음 도시만큼만 주유
//          - 만약 첫번째 도시의 주유값이 최소값이면? 모든 비용 여기서 처리
//      - 이걸 반복함. 대신, 마지막 도시의 주유비용은 고려하지 않음. 왜냐? 마지막 도시는 더이상 이동할 곳이 없으므로 해당x
//      - min 비용을 구할 때, 0부터 n-1까지의 도시에서 비용을 구해야함.
//      - 누적되는 거리는 입력받은거 전부 더함
//      - 주유 필요한 거리를 주유할 때 마다 빼줌.
//      - 주유한만큼 비용을 더해줌
//      - 1. 최소 비용을 구하기 위해 오름차순으로 정렬하거나, 2. 1회 순회하는것을 고려
//      - 1이 그래도 비용이 작으니까.. 오름차순 정렬해서 첫번째 인자값 찾아야겠다.
// 2. 자료구조
//      - n = Int // 도시 수
//      - r = [Int] // 모든 도시사이의 거리. 0번째 인덱스에 0 삽입할것.
//      - g = [Int] // 도시별 주유 비용
//      - m = Int // 발생한 주유 비용
//      - d(미사용) = Int // 모든 도시간의 거리 총합? 이 필요할까? 필요하다. 더이상 주유 필요없음을 확인해야한다.
//      - minV = Int // 마지막 도시를 제외한 곳들의 최소 주유비
// 3. 시간 복잡도
//      - O(NlogN), N = 1e5, ~= 20*1e5 ~- 1e6.
//      - 1초당 3e7, 2초 제한이므로 6e7. 널널함.
//      - 새로운 시간복잡도.
//      - O(N) : minV를 미리 구하지 않고 순회하면서 구하므로..!

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var r = [0]
    
    r.append(contentsOf: readLine()!.split(separator: " ").map { Int($0)! })
    
    let g = readLine()!.split(separator: " ").map { Int($0)! }
    
    var minV = g[0]
    
    var m = 0
    
    for i in 0...n-2 {
        minV = min(minV, g[i])
        m += r[i+1] * minV
    }
    
    print(m)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// minV를 한번에 구하면, 방문하지 않은 도시에 대한 정보를 알고 있게 됨.
// 따라서 순회하면서 그 값을 업데이트 해야함.
// 순회하면서 업데이트 하면 d계산도 필요없어짐. -> O(N)으로 시간복잡도 줄게됨.



