//
//  BOJ-11399
//  백준 11399번 - ATM
//
//  Created by 손지영 on 2026/01/25
//  난이도: 실버4 | 소요시간: 13분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11399
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 줄을 서는 순서에 따라 인출까지 필요한 시간이 달라짐.
//      - 모돈 돈을 인출하는 필요한 시간의 최소값
//      - 일단 정렬함. 오름차순으로.
//      - 시간 복잡도를 생각해보자. 일단 오름차순 정렬해야하니까: logN, 그다음 전체 순회 한번 하니까 O(N).
//      - 각 누적값을 더해서 출력해야함.
// 2. 자료구조
//      - t [Int]
//      - total(전체 누적) Int, sum(나의 누적) Int
// 3. 시간 복잡도
//      - O(NlogN) N이 1e4이므로 충분

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let t = readLine()!
        .split(separator: " ")
        .map { Int($0)! }
        .sorted()
    
    var total = 0
    var sum = 0
    
    for i in 0..<t.count {
        sum += t[i]
        total += sum
    }
    
    print(total)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
//
