
import Foundation

// MARK: - DP
//
// Dynamic Programming
// 이전의 값을 재활용하는 알고리즘
//
// 어떤값을 저장할 것인가, 이전 값들로 부터 어떻게 현재 값을 구할것인가가 중요
//
// 예시. 1~10 숫자 중, 각각 이전값들을 합한 값 구하기
// 1 -> 1
// 2 -> 1 + 2 = 3
// 3 -> 1 + 2 + 3 = 6
// ...
// for문을 사용해서 이전 index를 모두 더하는 계산일 때 시간 복잡도가 O(N^2)
// DP를 사용한다면, 이전값을 재활용하기 때문에
// 1 -> 1
// 2 -> 1(이전값) + 2 = 3
// 3 -> 3(이전값) + 3 = 6
// 시간 복잡도가 O(N)이 됨
//
// https://www.acmicpc.net/problem/11726
//
// 1. 아이디어
//  A1: 1, A2: 2, A3: 1 + 2
//  An = A(n-1) + A(n-2)
//  for문으로 3 부터 N까지 돌면서
//  이전값과 그 이전값을 더해서 저장
//      => 점화식: An = An-1 + An-2
//      => N번째 값 구하기 위해 for문 3부터 N까지의 값을 구해주기
//      => 이전값, 이전이전값 더해서, 10007로 나눠 저장
// 2. 시간복잡도
//  O(N)
// 3. 자료구조
//  DP값 저장하는 경우의수: [Int]
//  최대값 10006 (10007로 나눈 나머지를 출력하므로)
//
// ============
//

func solution() {
    let n = Int(readLine()!)!
    
    // 경우의수 2xi 크기의 직사각형을 채우는 방법의 수
    // result[0] = 2x0 크기의 직사각형을 채우는 방법의 수 = 0
    /*
     ┌─┐
     │ │  → 1가지 방법
     └─┘
     */
    // result[1] = 2x1 크기의 직사각형을 채우는 방법의 수 = 1
    /*
     방법1: 세로 타일 2개    방법2: 가로 타일 2개
     ┌─┬─┐              ┌──┐
     │ │ │              ├──┤  → 2가지 방법
     └─┴─┘              └──┘
     */
    // result[2] = 2x2 크기의 직사각형을 채우는 방법의 수 = 2
    /*
     n=3부터는 점화식 result[n] = result[n-1] + result[n-2]를 사용
     */
    if n == 1 {
        print(1)
    } else if n == 2 {
        print(2)
    } else {
        var result = [0, 1, 2]
        
        for i in 3...n {
            result.append((result[i - 1] + result[i - 2]) % 10007)
        }
        
        print(result[n])
    }
}

solution()
