//
//  BOJ-2193
//  백준 2193번 - 이친수
//
//  Created by 손지영 on 2026/01/31
//  난이도: 실버3 | 소요시간: 18분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2193
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     0으로 시작하지 않고, 연속한 1이 나타나지 않는 수: 이친수
///     1. dp 정의
///         i 자리로 이루어진 이진수 중 이천수의 개수
///     2. i의 진행방향
///         n이 1이면 1 -> 이친수 갯수: 1
///         n이 2이면 01, 10, 11 -> 이친수 갯수: 1
///         n이 3이면 001, 010, 100, 011, 101, 110, 111, 000 -> 이친수 갯수: 2
///         i-1: i-1자리 만큼 이친수로 채우고, 남은 자리를 0으로 채우는 경우
///         i-2: i-2자리 만큼 이친수로 채우고, 남은 자리를 01로 채우는 경우
///     3. 점화식
///         dp[i] = dp[i-2] + dp[i-1]
///     4. 초기값
///         dp[1] = 1
///         dp[2] = 1
/// 2. 자료구조
///     dp[Int]
/// 3. 시간 복잡도
//      O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    if n == 1 || n == 2 {
        print(1)
    } else {
        var dp = Array(repeating: 0, count: n+1)
        
        dp[1] = 1
        dp[2] = 1
        
        for i in 3...n {
            dp[i] = dp[i-1] + dp[i-2]
        }
        
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
