//
//  BOJ-11727
//  백준 11727번 - 2×n 타일링 2
//
//  Created by 손지영 on 2026/01/31
//  난이도: 실버3 | 소요시간: 21분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11727
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     1x2, 2x1, 2x2
///     1. dp 정의
///         dp[i]는 2xi 타일을 주어진 타일로 채울 수 있는 방법의 수
///     2. i의 진행방향
///         앞에서부터 채우는, i-1까지 채운 경우의 수: dp[i-1]
///         뒤에서부터 채우는, 마지막 두 열을 가로 1x2 두개 혹은 2x2 하나로 채움: dp[i-2] * 2
///     3. 점화식
///         dp[i] = (dp[i-1] + 2 * dp[i-2]) % mod
///     4. 초기값
///         dp[1] = 1
///         dp[2] = 3
/// 2. 자료구조
///     mod = 10_007
///     dp[Int]
/// 3. 시간 복잡도
///     O(N)
//
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    if n == 1 {
        print(1)
    } else if n == 2 {
        print(3)
    } else {
        var dp = Array(repeating: 0, count: n+1)
        
        dp[1] = 1
        dp[2] = 3
        
        let mod = 10_007
        
        for i in 3...n {
            dp[i] = (dp[i-1] + 2 * dp[i-2]) % mod
        }
        
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
