//
//  BOJ-16194
//  백준 16194번 - 카드 구매하기 2
//
//  Created by 손지영 on 2026/01/31
//  난이도: 실버3 | 소요시간: 25분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/16194
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     N개의 카드를 얻기 위한 최소 지불 비용.
///     1. dp 정의
///         i개의 카드를 구하기 위한 최소 지불 비용
///     2. i 진행방향
///         이전 선택과 지금 선택 중 저렴한것이 필요.
///         p[i]와 낱개 구매 중에 저렴한것
///
///         i=3, p[i], (dp[2] + dp[1]) , dp[1]*3
///                 => 2, 1 카드 모두 비교
///         i=4, p[i], (dp[3] + dp[1]), dp[2] * 2, dp[1] * 4
///                 => 3, 2, 1 카드 모두 비교
///         공통점:
///             1 ~ i-1까지의 카드팩을 모두 고려하고 있음
///         고려할 카드팩을 j, i는 구매해야하는 카드팩 수 일때
///         dp[i] = p[i]
///         for j in 1...n-1
///             dp[i] = min(dp[i], dp[j] + dp[i-j])
///     3. 점화식
///         dp[i] = min(dp[i], dp[j] + dp[i-j])
///     4. 초기값
///         dp[1] = p[1]
///         dp[2] = min(p[1] * 2, p[2])
/// 2. 자료구조
///     p[Int]
///     dp[Int]
/// 3. 시간 복잡도
///     O(N^2)
//
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var p = [0]
    p.append(contentsOf: readLine()!.split(separator: " ").map { Int($0)! })
    
    if n == 1 {
        print(p[1])
    } else if n == 2 {
        print(min(p[1] * 2, p[2]))
    } else {
        var dp = Array(repeating: 0, count: n+1)
        
        dp[1] = p[1]
        dp[2] = min(p[1] * 2, p[2])
        
        for i in 3...n {
            dp[i] = p[i]
            for j in 1..<i {
                dp[i] = min(dp[i], dp[j] + dp[i-j])
            }
        }
        
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================


/*
swift BOJ-16194.swift <<EOF
10
1 1 2 3 5 8 13 21 34 55
EOF
 */
