//
//  BOJ-1904
//  백준 1904번 - 01타일
//
//  Created by 손지영 on 2026/01/31
//  난이도: 실버3 | 소요시간: 9분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1904
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     1. dp[i] 정의
///         길이가 i인, 만들 수 있는 이진 수의 갯수
///     2. i의 진행방향
///         길이 i를 만드는 방법은
///         i-1를 먼저 만들고 뒤를 1로 채우는 방법과
///         i-2로 먼저 만들고 뒤를 00로 채우는 방법
///     3. 점화식
///         dp[i] = dp[i-1] + dp[i-2]
///     4. 초기값
///         dp[1] = 1
///         dp[2] = 2
/// 2. 자료구조
///     mod = 15746
///     dp[Int]
/// 3. 시간 복잡도
///     O(N)
//
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    if n == 1 {
        print(1)
    } else if n == 2 {
        print(2)
    } else {
        let mod = 15746
        var dp = Array(repeating: 0, count: n+1)
        
        dp[1] = 1 % mod
        dp[2] = 2 % mod
        
        for i in 3...n {
            dp[i] = (dp[i-1] + dp[i-2]) % mod
        }
        
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
