//
//  BOJ-11053
//  백준 11053번 - 가장 긴 증가하는 부분 수열
//
//  Created by 손지영 on 2026/01/31
//  난이도: 실버2 | 소요시간: 17분 | 상태: ⏳
//  링크: https://www.acmicpc.net/problem/11053
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심 아이디어
///     1. dp 정의
///         i를 마지막 원소로 하는 부분 수열의 길이
///     2. i 진행방향
///         dp[i]는 A[1...i-1] 까지 비교했을 때, dp[i]와 dp[j]+1 중에 큰값
///             => +1의 이유: 수열이 연결되므로 지금것 선택한다는 의미
///         dp[i] = 1
///         for j in 1..<i
///             dp[i] = max(dp[i], dp[j] + 1)
///     3. 점화식
///         dp[i] = max(dp[i], dp[j] + 1)
///     4. 초기값
///         dp[1...n] = 1
///
/// 2. 자료구조
///     dp[Int]
///     max Int
/// 3. 시간 복잡도
///     O(N^2)
//
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var a = [0]
    a.append(contentsOf: readLine()!.split(separator: " ").map { Int($0)! })
    
    if n == 1 {
        print(1)
    } else {
        var dp = Array(repeating: 1, count: n + 1)
        
        var maxV = 1
        
        for i in 2...n {
            for j in 1..<i {
                guard a[j] < a[i] else { continue }
                dp[i] = max(dp[i], dp[j] + 1)
                maxV = max(maxV, dp[i])
            }
        }
        
        print(maxV)
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// 항상 마지막 인자가 연결된 인자는 아니다.
