//
//  BOJ-1463
//  백준 1463번 - 1로 만들기
//
//  Created by 손지영 on 2026/01/19
//  난이도: 실버3 | 소요시간: 35분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1463
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
//  1. 핵심아이디어
//      - 연산 가능한 모든 경우의수를 찾아야함
//      - min으로 비교 가능한가?
//          : dp로 접근하면 가능할듯
//      - 그럼 연산별로 return을 하거나 inout을 사용?
//      - 입력값이 10일때
//          - 1. 1빼기
//          - 2. (9입력) 3으로 나누기, 1빼기
//          - 3-1. (3입력) 3으로 나누기, 1빼기
//              - 4-1. (1입력) 1 나옴 (이게 가장 빠름)
//              - 4-2. (2입력) 2로 나누기, 1빼기
//                  - 5-1. (1입력) 1나옴
//                  - 5-2. (1입력) 1나옴
//          - 3-2. (8입력)
//              - 4-1. 2로 나누기, 1빼기
//                  - 5-1. (4입력) 2로 나누기, 1빼기
//                      - 6-1. (2입력)
//                      - 6-2. (3입력)
//                  - 5-2. (7입력) 1빼기
//          - 입력값으로 부터 1씩 내려오면서 찾기. 뭘 찾느냐 1이 되는것.
//          - 연산 3개를 비교해서 최소값을 찾아야함 (여기서 i는 연산해서 나올 수 있는 숫자 그 자체)
//          - dp[i/2], dp[i/3]는 조건에 부합했을 때, dp[i-1]은 항상.
//          - 연산이 발생하면 +1 해줘야함.
//  2. 자료구조
//      - input: Int
//      - dp: [Int]
//  3. 시간복잡도
//      - 연산은 최악의 경우 O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let num = Int(readLine()!)!
    
    if num == 1 {
        print(0)
    } else if num == 2 {
        print(1)
    } else if num == 3 {
        print(1)
    } else {
        var dp = Array(repeating: Int.max, count: num + 1)
        
        dp[1] = 0
        dp[2] = 1
        dp[3] = 1
        
        for i in 4...num {
            dp[i] = dp[i-1] + 1
            if i % 3 == 0 {
                dp[i] = min(dp[i], dp[i/3] + 1)
            }
            if i % 2 == 0 {
                dp[i] = min(dp[i], dp[i/2] + 1)
            }
        }
        
        print(dp[num])
    }
    
    
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
