//
//  BOJ-14501
//  백준 14501번 - 퇴사
//
//  Created by 손지영 on 2026/01/19
//  난이도: 실버3 | 소요시간: 40분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/14501
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심아이디어
//      - 종료 조건 : 오늘날짜 + 지금까지 상담한 날짜 < N+1
//      - 최대 수익 구하기.
//          - 선택 한다/안한다의 분기로 정해야함
//          - i가 날짜라면 T[i]는 소요 시간. i+T[i] 만큼 뒤로 가야함
//              - 이때 P[i]의 더한 값들이 최대가 되어야함
//          - 마지막날부터 접근.
//              - T[N]은 상담 불가능함. T[N] 자체로 N+1 초과하기 때문,
//                  : T[i]가 N+1보다 작아야하고 (이 자체로는 N이 상담 가능한것일 뿐 최대 수익은 아님) 이건 5가 됨 (선택)
//                  : P[5] = 15
//              - 위를 충족하고, 이전 상담 가능 날짜를 찾아야하는데
//                  : i(지금 선택한 날짜 예. 4일) + 1 <= N + 1
//                  : p[i] + dp[i + t[i]] // 4일 + 5일 수익
//                  : dp[i+1] // 5일 수익
//                  : 두개의 max를 찾으면 최대수익이 됨.
// 2. 자료구조
//      - day 퇴사까지 남은 일자 Int
//      - t: 일자별 상담 필요 기간 [Int]
//      - p: 상담별 수익 발생 [Int]
//      - dp: 최대수익배열 [Int]
// 3. 시간복잡도
//      - O(N)?
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let d = Int(readLine()!)!
    
    var t = Array(repeating: 0, count: d + 1)
    var p = Array(repeating: 0, count: d + 1)
    
    var dp = Array(repeating: 0, count: d + 2)
    
    for i in 1...d {
        let input = readLine()!.split(separator: " ").map { Int($0)! }
        t[i] = input[0]
        p[i] = input[1]
    }
    
    for i in stride(from: d, through: 1, by: -1) {
        if i + t[i] <= d + 1 {
            dp[i] = max(p[i] + dp[i + t[i]], dp[i + 1])
        } else {
            dp[i] = dp[i+1]
        }
        
    }
    
    print(dp[1])
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================

