//
//  BOJ-1920
//  백준 1920번 - 수 찾기
//
//  Created by 손지영 on 2026/01/22 20:35
//  난이도: 실버4 | 소요시간: 16분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1920
//

import Foundation


// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - A배열 안에 B배열의 인자들이 포함되어있는지 확인
//      - 있으면 1 없으면 0
//      - left 1, right n-1
//      - B배열 인자수 만큼 반복
//          - 중위값부터 시작 (left + (right - left) / 2)
//          - 중위값이랑 B배열 인자랑 같으면 1 출력하고 반복문 종료
//          - 중위값이 인자값보다 작으면 왼쪽의 범위를 줄인다, left = mid + 1
//          - 중위값이 인자값보다 크면 오른쪽의 범위를 줄인다, right = mid - 1
// 2. 자료구조
//      - a: [Int]
//      - b: [Int]
// 3. 시간 복잡도
//      - O(M * logN) 이진 탐색을 M개 인자만큼 반복하니까.
//      - M: 100_000 = 10^5, n: 10^5
//          10^3 = 2^10, 크게 잡아도 2^20, logN = 20
//          10^5 * 20 ~= 2 * 10^6
//      - a는 오름차순 정렬해야하니까.. logN 더해야한다.

// ============================================
// 📌 주의사항
// ============================================
//

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let a = readLine()!.split(separator: " ").map { Int($0)! }.sorted()
    
    let _ = Int(readLine()!)!
    let b = readLine()!.split(separator: " ").map { Int($0)! }
    
    for i in b {
        var left = 0
        var right = n - 1
        var isFound = false
        
        while left <= right {
            var mid = left + (right - left) / 2
            if a[mid] == i {
                isFound = true
                break
            } else if a[mid] < i {
                left = mid + 1
            } else {
                right = mid - 1
            }
        }
        
        print(isFound ? 1 : 0)
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
//
