//
//  BOJ-10157
//  백준 10157번 - 자리배정
//
//  Created by 손지영 on 2026/01/19
//  난이도: 실버4 | 소요시간: 35분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/10157
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
// 1. 핵심 아이디어
//      - 1,1부터 시계방향 1,1->1,2->1,3 순으로
//      - 위쪽으로 빈 좌석이 없으면 오른쪽으로 1,6 -> 2,6 -> 3,6
//      - 오른쪽에 더이상 빈좌석 없으면 7,6 -> 6,6 -> 5,6 -> 1,6
//      - 다시 왼쪽 -> 위쪽으로 빈 좌석이 없을 때 까지 반족
//      - 방문여부 체크
//      - dy, dx 사용해서 포지션 하나씩 옮김.
//      - 어느 방향으로 이동하고 있는지도 함께 체크
//      - k번에게 몇번 좌석이 배정되는지
//      - 좌석을 배정할 수 없는 경우 0출력
// 2. 자료구조
//      - map [[Int]]
//      - 방문여부 [[Bool]]
//      - 방향 String,, enum,,
// 3. 시간 복잡도
//      - O(N*M)

// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let size = readLine()!.split(separator: " ").map { Int($0)! }
    let n = size[0]; let m = size[1]
    
    let k = Int(readLine()!)!
    
    var chk = Array(repeating: Array(repeating: false, count: n), count: m)
    
    var cnt = 0
    
    let dy = [-1, 0, 1, 0]
    let dx = [0, 1, 0, -1]
    
    var dir = 0
    
    func simulate(y: Int, x: Int) {
        if k > n * m {
            print(0)
            return
        }
        
        (chk[y])[x] = true
        cnt += 1
        
        if cnt == k {
            print("\(x + 1) \(m - y)")
            return
        }
        
        let ny = y + dy[dir]
        let nx = x + dx[dir]
        
        if ny < 0 || ny >= m || nx < 0 || nx >= n || (chk[ny])[nx] {
            dir = (dir + 1) % 4
            simulate(y: y + dy[dir], x: x + dx[dir])
        } else {
            simulate(y: ny, x: nx)
        }
    }
    
    simulate(y: m - 1, x: 0)
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
// dy dx가 항상 우 하 상 좌는 아니다. 이건 상 우 하 좌로 이동해야함
// 방향전환은 나머지를 이용할것
