//
//  BOJ-11052
//  백준 11052번 - 카드 구매하기
//
//  Created by 손지영 on 2026/02/23
//  난이도: 실버1 | 소요시간: 28분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11052
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 8가지 단계
///     - 1개 이상 N개 이하가 포함된 카드팩
///     - 비싸면 높은 등급의 카드가 많음, 최대한 많은 돈을 질부해서 N개의 카드팩 구매
///     - 구매하고 싶은 카드팩의 갯수를 최대한 작은 갯수의 카드팩으로 최대의 금액을 지불해야함.
///     - 조합과 max를 조합한다면... O(N^2) = 1e6 입력 초과할듯
///     - DP를 활용할것.
///     1. dp[i]의 정의
///         - 카드 i 장을 살때의 최대 가격
///     2. i의 진행방향
///         - i장을 k장 만큼 살때, 이전 카드팩과 비교해서 비싼것으로
///         - 이전 카드팩은 1...i 이어야함
///     3. dp의 점화식
///         - dp[i] = max(dp[i], dp[j-i] + price[j-1])
///     4. dp 초기값
///         - dp[0] = 0
/// 2. 자료구조
///     - dp [Int]
/// 3. 시간복잡도
///     - O(N^2)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let p = readLine()!.split(separator: " ").map { Int($0)! }
    
    var dp = Array(repeating: 0, count: n + 1)
    
    for i in 1...n {
        for j in 1...i {
            dp[i] = max(dp[i], dp[i-j] + p[j-1])
        }
    }
    
    print(dp[n])
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
