//
//  BOJ-17427
//  백준 17427번 - 약수의 합 2
//
//  Created by 손지영 on 2026/02/26
//  난이도: 실버2 | 소요시간: 25분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/17427
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - A = BC를 만족하면 C를 A의 약수, C = A/B
///         - for 1부터 n까지 위 수식을 만족하면 약수로 취급
///     - 모든 약수를 더한 값 = f(A)
///     - x보다 작거나 같은 모든 자연수 y의 f(y)를 더한값은 g(x)
///     - g(N) = N보다 작거나 같은 모든 자연수의 약수의 합을 더함
///     -> 시간초과 발생
///     - (n/i) -> i를 약수로 가지는 수가 범위(1...n)안에 몇개 있는지
///     - i * (n/i) -> 모든 합을 구하므로, 개수 정보를 찾으면 더할값을 찾아줌
/// 2. 자료구조
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var rs = 0
    
    for i in 1...n {
        rs += i * (n/i)
    }
    
    print(rs)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
