//
//  BOJ-1309
//  백준 1309번 - 동물원
//
//  Created by 손지영 on 2026/02/20
//  난이도: 실버1 | 소요시간: 12분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1309
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 가로로 두칸 세로로 N칸에서 대각선으로 이어지게 배치할 수 있는 방법
///     - 한마리도 배치 하지 않는것도 하나의 경우의수
///     1. dp의 정의
///         - dp[i][0, 1, 2]
///         - i번째 줄에 0 배치 안함, 1 왼쪽 배치, 2 오른쪽 배치
///     2. dp i, j 방향
///         - i는 1씩 증가함
///         - j는 배치 유무와 배치 위치
///         - i-1에서 아무곳도 배치하지 않았다면 왼쪽 오른쪽 둘다 가능, 배치하지 않는것도 가능
///         - i-1에서 왼쪽에 배치했으면 오른쪽만, 오른쪽에 배치했으면 왼쪽만 배치 가능
///     3. dp 점화식
///         - dp[i][0] = dp[i-1][0] + dp[i-1][1] + dp[i-1][2]
///         - dp[i][1] = dp[i-1][0] + dp[i-1][2]
///         - dp[i][2] = dp[i-1][0] + dp[i-1][1]
///     4. dp 초기값
///         - dp[1][0] = 1, dp[1][1] = 1, dp[1][2] = 1
/// 2. 자료구조
///     dp [[Int]]
/// 3. 시간복잡도
///     - O(N * 3)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    let mod = 9901
    var dp = Array(repeating: Array(repeating: 0, count: 3), count: n + 1)
    
    for i in 0..<3 {
        dp[1][i] = 1 % mod
    }
    
    if n > 1 {
        for i in 2...n {
            dp[i][0] = (dp[i-1][0] + dp[i-1][1] + dp[i-1][2]) % mod
            dp[i][1] = (dp[i-1][0] + dp[i-1][2]) % mod
            dp[i][2] = (dp[i-1][0] + dp[i-1][1]) % mod
        }
    }
    
    print(dp[n][0...2].reduce(0, +) % mod)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
