//
//  BOJ-10430
//  백준 10430번 - 나머지
//
//  Created by 손지영 on 2026/02/25
//  난이도: 브론즈5 | 소요시간: 3분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/10430
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 순서대로 연산
/// 2. 자료구조
/// 3. 시간복잡도
///     - O(1)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let a = input[0]; let b = input[1]; let c = input[2]
    
    print((a+b)%c)
    print(((a%c) + (b%c)) % c)
    print((a*b)%c)
    print(((a%c)*(b%c))%c)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
