//
//  BOJ-16967
//  백준 16967번 - 배열 복원하기
//
//  Created by 손지영 on 2026/02/22
//  난이도: 실버3 | 소요시간: 34분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/16967
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - B = (AH x X) x (AW x Y)
///     - B에 포함된 값들이 (i, j)
///         두 배열에 모두 미포함 = B[i][j] = 0
///         두 배열에 모두 포함 = B[i][j] = A[i][j] + A[i-X][j-Y]
///         두 배열 중 하나에 포함 = B[i][j] = A[i][j] 또는 A[i-X][j-Y]
///     - 겹쳐지는 수는 합한다.
///     - 배열 B와 X Y가 주어졌을 때 A를 구하라.
///     - dp로 풀어볼 수 있을것 같은데
///         1. 초기값
///             i또는 j가 0이면 두 배열에 모두 포함이 됨. 따라서 a[i][0]이거나 a[0][j]는 초기값을 가짐
///         2. dp i, j 진행방향
///             i, j는 0보다 크고 각각 y, x보다 작아야함
///         3. dp 점화식
///             모두 포함된 경우
///             단, i-y와 j-x가 0보다 커야함 (겹칠 수 있으면 겹치는것이므로)
///             a[i][j] = b[i][j]
///             if 겹치면
///                  a[i][j] -= a[i-y][j-x]
/// 2. 자료구조
///     - a [[Int]]
/// 3. 시간복잡도
///     - O(H*W)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let h = input[0]; let w = input[1]
    let x = input[2]; let y = input[3]
    
    var b = [[Int]]()
    
    for _ in 0..<h+x {
        b.append(readLine()!.split(separator: " ").map { Int($0)! })
    }
    
    var a = Array(repeating: Array(repeating: 0, count: w), count: h)
    
    for col in 0..<w {
        a[0][col] = b[0][col]
    }
    
    for y in 0..<h {
        a[row][0] = b[row][0]
    }
    
    for i in 1..<h {
        for j in 1..<w {
            a[i][j] = b[i][j]
            if i-x >= 0, j-y >= 0 {
                a[i][j] -= a[i-x][j-y]
            }
        }
    }
    
    for row in a {
        print(row.map { String($0) }.joined(separator: " "))
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================


/*
swift BOJ-16967.swift <<EOF
3 3 2 1
1 2 3 0
4 5 6 0
7 9 11 3
0 4 5 6
0 7 8 9
EOF
 */
