//
//  BOJ-1978
//  백준 1978번 - 소수 찾기
//
//  Created by 손지영 on 2026/02/26
//  난이도: 브론즈2 | 소요시간: 14분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1978
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 소수찾기
/// 2. 자료구조
/// 3. 시간복잡도
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let _ = Int(readLine()!)!
    let arr = readLine()!.split(separator: " ").map { Int($0)! }
    
    var rs = 0
    
    for num in arr {
        if isPrime(num) { rs += 1 }
    }
    
    func isPrime(_ k: Int) -> Bool {
        if k < 2 { return false }
        if k == 2 { return true }
        if k % 2 == 0 { return false }
        
        var i = 3
        while i * i <= k {
            if k % i == 0 { return false }
            i += 2
        }
        return true
    }
    
    print(rs)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
