//
//  BOJ-10844
//  백준 10844번 - 쉬운 계단 수
//
//  Created by 손지영 on 2026/02/20
//  난이도: 실버1 | 소요시간: 21분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/10844
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 인접한 모든 자리의 차이가 1일 때 "계단수"
///     - 길이가 N인 계단수의 총 개수
///     - 자리수N인 수 중 인접한 값이 1인 모든 수
///     - dp로 접근
///     1. dp[i]의 의미
///         - i는 자릿수
///     2. dp[i]의 방향
///         - i가 늘어남에 따라 0..9까지 올수 있는 수가 정해짐 -> 다시 반복문 필요 2차원 dp로 접근 필요한듯
///     1. dp[i][j]의 의미
///         - i는 자릿수, j는 끝자리 수
///         - 자리수가 1, 끝자리수가 0이면 값이 0 => 0으로 시작하면 계단수가 아님
///         - 자리수가 1, 끝자리수가 1이면 값이 1 => 1
///         - 자리수가 1, 끝자리수가 2이면 값이 1 => 2
///         - 자리수가 2, 끝자리수가 0이면 값이 1 => 10
///         - 자리수가 2, 끝자리수가 1이면 값이 1 => 21 = dp[1][0] + dp[1][2] = 자리수가 2이므로 2차이 나야함
///     2. i, j의 방향
///         - i: 1~100, j: 0...9
///     3. dp의 점화식
///         - j: 자리수, i: 끝자리 값
///         - dp[j][i] = dp[j-1][i-1] + dp[j-1][i+1]
///     4. dp의 초기값
///         - dp[1][0] = 0
///         - dp[1][1...9] = 1
/// 2. 자료구조
///     - dp [[Int]]
/// 3. 시간복잡도
///     - O(N*10)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    let mod = 1_000_000_000
    var dp = Array(repeating: Array(repeating: 0, count: 10), count: n + 1)
    dp[1][0] = 0 % mod
    for i in 1...9 {
        dp[1][i] = 1 % mod
    }
    
    if n > 1 {
        for j in 2...n {
            dp[j][0] = dp[j-1][1] % mod
            dp[j][9] = dp[j-1][8] % mod
            
            for i in 1...8 {
                dp[j][i] = (dp[j-1][i-1] + dp[j-1][i+1]) % mod
            }
        }
    }
    
    print(dp[n][0...9].reduce(0, +) % mod)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
