//
//  BOJ-13398
//  백준 13398번 - 연속합 2
//
//  Created by 손지영 on 2026/02/25
//  난이도: 골드4 | 소요시간: 42분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/13398
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 몇개의 수를 선택, 구할 수 있는 가장 큰 합
///     - 시간 제한은 2초, 1e7정도 되야함. 입력값의 최대는 1e5
///     - DFS는 n^2므로 시간초과됨 -> DP로 우선 접근
///     1. dp의 정의
///         - state: 수 삭제 횟수. 최대 1
///         - s[i]에서 끝나는 최대값
///     2. i의 진행방향
///         - i: 0..<n
///         - state: 0 또는 1
///     3. dp 점화식
///         - dp[0][i] = max(dp[0][i-1] + a[i], a[i])
///         - dp[1][i] = max(dp[1][i-1] + a[i], dp[0][i-1])
///         dp[0][i-1]의 의미: a[i]의 삭제를 고려해야하므로, 이전(i-1)까지 삭제하지 않은(0) 상황이어야함.
///     4. dp 초기값
///         - dp[0][0] = a[0]
/// 2. 자료구조
///     - dp [[Int]]
///     - rs Int
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let a = readLine()!.split(separator: " ").map { Int($0)! }
    
    var dp = Array(repeating: Array(repeating: 0, count: n), count: 2)
    dp[0][0] = a[0]
    
    var rs = a[0]
    
    for i in 1..<n {
        dp[0][i] = max(dp[0][i-1] + a[i], a[i])
        dp[1][i] = max(dp[1][i-1] + a[i], dp[0][i-1])
        rs = max(rs, max(dp[0][i], dp[1][i]))
    }
    
    print(rs)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================

