//
//  BOJ-1917
//  백준 1917번 - 정육면체 전개도
//
//  Created by 손지영 on 2026/02/25
//  난이도: 골드1 | 소요시간: 20분 | 상태: ⌛️
//  링크: https://www.acmicpc.net/problem/1917
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 정육면체 전개도....
///     - 조건을 만족하려면 어떻게 되야하나
///     - 정육면체들의 "상대적 위치".. (참고: [1499번 문제](../Day19/BOJ-14499.swift))
///         - 윗면은 항상 아랫면과 대칭
///         - 동: x+1, 서: x-1, 남: y+1, 북: y-1
///         - dice 인덱스: [top, north, east, west, south, bottom]
///         - 전개도(인덱스 기준)
///                   [1: north]
///         [3: west] [0: top] [2: east]
///                   [4: south]
///                   [5: bottom]
///         - 기본: 1 2 3 4 5 6
///           동으로 이동 : 4 2 1 6 5 3
///           서로 이동  : 3 2 6 1 5 4
///           남으로 이동 : 2 6 3 4 1 5
///           북으로 이동 : 5 1 3 4 6 2
/// 2. 자료구조
///     - map [[Int]]
///     - cube [Int]
/// 3. 시간복잡도
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    for _ in 0..<3 {
        var map = [[Int]]()
        
        for _ in 0..<6 {
            map.append(readLine()!.split(separator: " ").map { Int($0)! })
        }
        
        var canSqure = false
        var cube = [(Int, Int)]()
        
        for r in 0..<6 {
            for c in 0..<6 {
                if map[r][c] == 1 { cube.append((r, c)) }
            }
        }
        
        if cube.isEmpty { print("no") }
        else {
            for c in cube {
                print(c)
            }
        }
        print()
    }
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
/// 전개도 찾기 어렵다.
