//
//  BOJ-11722
//  백준 11722번 - 가장 긴 감소하는 부분 수열
//
//  Created by 손지영 on 2026/02/24
//  난이도: 실버2 | 소요시간: 25분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11722
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 부분 수열 중 가장 긴 감소
///     - 부분 수열의 조건 중 이전 값보다 현재 값이 작아야한다는것을 추가하면 어느정도 걸러질듯.
///     -> 시간초과 발생
///     - dp로 접근
///     1. dp의 정의
///         - i번째 원소를 마지막으로 하는 부분 수열의 길이
///     2. i의 진행방향
///         - 0..<n
///     3. dp 점화식
///         // 현재 값의 길이와 이전 값의 길이 + 1를 비교
///         - dp[i] = max(dp[i], dp[j] + 1)
///     4. 초기값
///         - dp[0..<n] = 1
///         하나씩만 선택한 길이가 1인 수열은 반드시 있음
/// 2. 자료구조
///     - temp [Int]
///     - rs Int
/// 3. 시간복잡도
///     - 부분수열 DFS: O(N^2)
///     - DP: O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let a = readLine()!.split(separator: " ").map { Int($0)! }
    
    var dp = Array(repeating: 1, count: n)
    
    func dfs() {
        for i in 0..<n {
            for j in 0..<i {
                if a[j] > a[i] {
                    dp[i] = max(dp[i], dp[j] + 1)
                }
            }
        }
    }
    
    dfs()
    
    print(dp.max()!)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
