//
//  BOJ-2609
//  백준 2609번 - 최대공약수와 최소공배수
//
//  Created by 손지영 on 2026/02/24
//  난이도: 브론즈1 | 소요시간: 8분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2609
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 최대공약수
///         a%b의 값이 0이 될때까지 반복해서 찾음, 0이되면 b 출력
///     - 최대공배수
///         axb를 최대공약수로 나눔
/// 2. 자료구조
/// 3. 시간복잡도
///     - O(log(min(a,b)))
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let a = input[0]; let b = input[1]
    
    func gcd(_ a: Int, _ b: Int) -> Int {
        if a % b == 0 { return b }
        else { return gcd(b, a % b) }
    }
    
    func lcm(_ a: Int, _ b: Int) -> Int {
        return a * b / gcd(a, b)
    }
    
    print(gcd(a, b))
    print(lcm(a, b))
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
