/*:
 ---
 * 1. DP의 정확한 정의
 ---
 */
/// DP(Dynamic Programming)는 "같은 부분 문제가 반복해서 등자할 때, 그 결과를 저장해 두고 재사용하여 전체 문제를 해결하는 방법"
/// 핵심 키워드: 부분 문제(Subproblem), 중복(Overlapping)
/// -> 이 두 가지가 동시에 성립하지 않으면 DP가 아님
/*
 ---
 * 2. DP 문제를 판별하는 2가지 질문
 ---
 */
/// Q1. 문제를 더 작은 문제로 쪼갤 수 있는가?
///     - N -> N-1, N-2
///     - i번째까지의 최적해 -> i-1번째까지의 최적해
/// Q2. 같은 계산을 여러 번 하게 되는가?
///     - 재귀로 풀면 동일한 입력이 반복 호출되는가?
///     - 예전에 계산했던 값을 사용한다는 생각이 드는가?
/*:
 ---
 * 3. 점화식이란 무엇인가?
 ---
 */
/// 현재 상태의 값 = 이전 상태들의 값으로 표현한 수식
///     예) dp[i] = dp[i-1] + dp[i-2]
///         i번째 결과는 i-1번째 결과와 i-2번째 결과를 이용해 만든다
/*:
 ---
 * 4. 점화식을 세우는 고정 사고 절차 ❗️
 ---
 */
/// ① 상태(State)를 정의한다
/// -> dp 배열이 의미하는 바를 문장으로 써야함
/// 예)
///   dp[i] = i번째까지 고려했을 때 얻을 수 있는 최대 점수
///   dp[i] = i번째 집까지 털었을 때의 최대 금액
///   dp[i] = 길이가 i인 수열의 개수
/// ② 현재 상태에서 선택지를 나눈다
///     - 선택한다/선택하지 않는다
///     - 왼쪽에서 온다/위에서 온다
///     - 이전 하나만 본다/이전 두 개만 본다
/// ③ 선택에 따라 이전 상태를 연결한다
/// 예)
///   i번째를 선택했다면, 그 직전엔 어디까지 가능한지?
///   이 선택을 하려면 이전에 어떤 상태여야 하는지?
/// ④ 초기값(Base Case)을 정한다
/// -> dp 배열 중 직접 값을 써줘야하는 시작점
/// 점화식이 깨지지 않도록 정하는 게 목적
/*:
 ---
 * 5. 예시로 연습해보는 DP (코드 없이)
 ---
 */
/// 문제
/// 계단이 N개 있다.
/// 한 번에 1칸 또는 2칸씩 오를 수 있다.
/// 꼭대기에 오르는 방법의 수는?
///
/// Step1. 상태 정의
///     dp[i] = i번째 계단에 도달하는 방법의 수
/// Step2. 선택지
///     i-1에서 1칸 올라오기, i-2에서 2칸 올라오기
/// Step3. 점화식
///     dp[i] = dp[i-1] + dp[i-2]
/// Step4. 초기값
///     dp[0] = 1, dp[1] = 1
/*:
 ---
 * 6. 스스로 점화식 세워보기
 ---
 */
/// 문제
///
/// 길이가 N인 배열이 있다.
/// 연속해서 선택할 수 없을 때, 선택한 수들의 최대 합을 구하라.
///
/// Step1. 상태 정의
///   연속으로 선택할 수 없음. 선택 하느냐, 하지 않느냐. 내가 더 큰값일수도 내 직전이 더 큰값일 수 도 있음
///   dp[i] = 0...i 까지 선택된 수들의 최대의 합.
/// Step2. 선택지
///   dp[i-2](0…i-2 값들의 최대값)과 nums[i]를 더한 값과, dp[i-1](직전 값들의 최대값)중 max 고르기
/// Step3. 점화식
///   dp[i] = max(dp[i-2] + nums[i], dp[i-1])
/// Step4. 초기값
///   dp[0] = max(nums[0], 0), dp[1] = max(dp[0], nums[1])
