//
//  BOJ-1463
//  백준 1463번 - 1로 만들기
//
//  Created by 손지영 on 2026/01/25
//  난이도: 실버3 | 소요시간: 25분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1463
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. dp 정의
///     dp[i] = i값을 계산하는 최소 연산 갯수
///     상태:
///         3개의 수식 중에 하나를 선택해야함. 이전과 비교했을 때 더 작은것으로 선택
///         i, i/3, i/2, i-1
///     점화식:
///         i%3 > dp[i] = min(dp[i/3] + 1, dp[i))
///         i%2 > dp[i] = min(dp[i/2] + 1, dp[i))
///         i > dp[i] = dp[i-1] + 1
///     기본값:
///         dp[1] = 1, dp[2] = 1, dp[3] = 2
/// 2. 자료구조
///     dp: i를 구하는 최소 연산 수 (1-base)
/// 3. 시간복잡도
///     O(N), N = 10^6 ~= 2^20
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var dp = Array(repeating: 0, count: n + 1)
    
    if n == 1 {
        print(0)
    } else if n == 2 {
        print(1)
    } else if n == 3 {
        print(1)
    } else if n > 3 {
        var dp = Array(repeating: 0, count: n + 1)
        dp[2] = 1
        dp[3] = 1
        
        for i in 4...n {
            dp[i] = dp[i-1] + 1
            if i%3 == 0 {
                dp[i] = min(dp[i/3] + 1, dp[i])
            }
            if i%2 == 0 {
                dp[i] = min(dp[i/2] + 1, dp[i])
            }
        }
        
        print(dp[n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
