//
//  BOJ-1010
//  백준 1010번 - 다리 놓기 : 조합으로 풀어보기
//
//  Created by 손지영 on 2026/01/25
//  난이도: 실버5 | 소요시간: - | 상태: ⏳
//  링크: https://www.acmicpc.net/problem/1010
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     1. dp[n][m] 정의
///         동쪽 m개 중에서 n개를 고르는 경우의 수
///     2. 초기값
///         dp[m][0] = 1 (아무것도 안 고르는 1가지)
///         dp[m][m] = 1 (모두 고르는 1가지)
///     3. 점화식
///         dp[m][n] = dp[m-1][n-1] + dp[m-1][n]
///         m을 기준으로:
///             n을 선택 = C(n-1, i-1)
///             n을 선택하지 않는다 = C(n-1, i)
///     => dp[m][n]을 출력하면 됨.
/// 2. 자료구조
///     dp[m+1][n+1]
/// 3. 시간복잡도
///     O(N*M)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    for _ in 0..<t {
        let input = readLine()!.split(separator: " ").map({ Int($0)! })
        let n = input[0]; let m = input[1]
        
        var dp = Array(repeating: Array(repeating: 0, count: n+1), count: m+1)
        
        for i in 0...m {
            dp[i][0] = 1
        }
        
        for i in 1...m {
            for j in stride(from: min(n, i), through: 1, by: -1) {
                dp[i][j] = dp[i-1][j-1] + dp[i-1][j]
            }
        }
        
        print(dp[m][n])
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
