//
//  BOJ-1010
//  백준 1010번 - 다리 놓기
//
//  Created by 손지영 on 2026/01/25
//  난이도: 실버5 | 소요시간: 60분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1010
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     항상 M이 N보다 크거나 같다.
///     1:1로만 연결 가능.
///     N만큼 다리를 지을것이고, 겹칠수는 없다.
///     선택 하고 안하고로 다음값이 정해짐.
///     N == M, N == 1 일때는 이해가 되는데 N < M일때는 어떻게 하지?
///     N: 4, M: 7일 때.. 1번은 7이 될 수 있음. 2번은 1의 영향을 받고.. 교차할 수 없음을 주의
///     다리를 지을 수 없는 경우도 있나? 그러니까, 겹쳐지는 경우는 고려하는것인가?
///         => 고려하지 않는것 같음. N개만큼 짓는것이 목표이므로.
///     다음 다리는 이전 다리의 개수에 더함. < 이건 확실 그럼, 나는 어떻게 구하느냐?
///     동쪽(M)에서 N개를 고른다!
///
///     만약 N이 1부터 다리 N개를 고른다면:
///         i=1 : dp[1] + dp[0] = 1 = dp[1, 1, 0, 0]
///         i=2 : dp[2] + dp[1] = 1 = dp[1, 1, 1, 0]
///         i=3 : dp[3] + dp[2] = 1 = dp[1, 1, 1, 1] = 항상1. dp[i]가 누적된 값이 아니게 됨
///     만약 N이 N부터 다리 N개를 고른다면:
///         i=3 : dp[3] + dp[2] = 0 = dp[1, 0, 0, 0]
///         i=2 : dp[2] + dp[1] = 0 = dp[1, 0, 0, 0]
///         i=1 : dp[1] + dp[0] = 1 = dp[1, 1, 0, 0] = dp[1]이 정상적으로 업데이트 됨
///     1. dp[i] 정의
///         dp[i] 동쪽에서 계산한 설치 가능 다리의 경우의수
///     2. dp 선택지
///         i = i + i-1?
///         겹치지 않기 위한 선택지:
///             - N의 1은 M에서 가장 작은것, N의 2는 그다음 큰걸 선택
///                 = 오른쪽에서 N개를 순서대로 고르는것?
///             - i   : 이 다리를 선택하지 않음 (이전까지 i개 고른 경우 유지)
///             - i-1 : 이 다리를 선택함
///     3. 점화식
///         dp[i] += dp[i-1]
///     4. 초기값
///         dp[0] = 1 // 아무것도 선택하지 않았음을 선택함.
///
/// 2. 자료구조
///     dp[i] = Int
/// 3. 시간복잡도
///     O(N*M)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let t = Int(readLine()!)!
    
    for _ in 0..<t {
        let input = readLine()!.split(separator: " ").map({ Int($0)! })
        let n = input[0]; let m = input[1]
        
        var dp = Array(repeating: 0, count: n+1)
        
        if n == 0 {
            print(1)
        } else {
            dp[0] = 1
            
            for i in 1...m {
                for j in stride(from: min(n, i), through: 1, by: -1) {
                    dp[j] += dp[j - 1]
                }
            }
            
            print(dp[n])
        }
    }
}

solution()

// ============================================
// ❌ 헷갈린점
// ============================================
/// DP에서는 선택의 순서는 고려하지 않는다, 단순히 조합의 개수만 고려한다.
