//
//  BOJ-2156
//  백준 2156번 - 포도주 시식
//
//  Created by 손지영 on 2026/02/16
//  난이도: 실버1 | 소요시간: 10분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2156
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 연속 3개 선택 안됨
///     - 인덱스 변경 안됨
///     - 가장 많은 양의 포도주를 마실 수 있는 프로그램
///     - dp로 우선 접근
///     1. dp[i]의 정의
///         - i번째 잔을 선택했을 때 최대로 마신 포도주의 양
///     2. i의 진행방향
///         - i번째 잔을 선택
///     3. dp[i] 점화식
///         - dp[i] = max(dp[i-1], max(dp[i-2]+a[i], dp[i-3] + a[i-1] + a[i]))
///     4. dp 초기값
///         - dp[1] = a[1]
///         - dp[2] = dp[1] + a[2]
/// 2. 자료구조
///     - a [Int]
///     - dp [Int]
/// 3. 시간복잡도
///     - O(N)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var a = [0]
    
    for _ in 0..<n {
        a.append(Int(readLine()!)!)
    }
    
    var dp = Array(repeating: 0, count: n + 1)
    dp[1] = a[1]
    
    if n >= 2 {
        dp[2] = dp[1] + a[2]
    }
    
    if n > 2 {
        for i in 3...n {
            dp[i] = max(dp[i-1], max(dp[i-2] + a[i], dp[i-3] + a[i-1] + a[i]))
        }
    }
    
    print(dp[n])
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
