//
//  BOJ-2133
//  백준 2133번 - 타일 채우기
//
//  Created by 손지영 on 2026/02/14
//  난이도: 골드4 | 소요시간: 23분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/2133
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 타일 채우기: dp
///     1. dp[i]의 정의
///         - 3xi칸을 채울 수 있는 경우의 수
///     2. i의 진행방향
///         - 벽의 크기 i+1
///     3. dp 점화식
///         - for i in stride(from: 2, through: n, by: 2)
///             dp[i] = dp[i-2] * 3 // 2칸을 빼고 채운 모든 경우의 수와, 2칸을 채우는 모든 경우의 수
///             for j in stride(from 4, through: i, by: 2)
///                 dp[i] += dp[i-j] * 2
///     4. dp 초기값
///         - dp[0] = 1
///         - dp[홀수] = 0
///         - dp[2] = 3
/// 2. 자료구조
///     - dp[Int]
/// 3. 시간복잡도
///     - O(N^2)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var dp = Array(repeating: 0, count: n + 1)
    dp[0] = 1
    
    if n % 2 == 0 {
        for i in stride(from: 2, through: n, by: 2) {
            dp[i] = dp[i-2] * 3
            for j in stride(from: 4, through: i, by: 2) {
                dp[i] += dp[i-j] * 2
            }
        }
    }
    
    print(dp[n])
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
