//
//  BOJ-1912
//  백준 1912번 - 연속합
//
//  Created by 손지영 on 2026/02/14
//  난이도: 실버2 | 소요시간: 10분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1912
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 연속된 몇개의 수를 선택할 때 가장 큰 합
///     - 수는 1개 이상 선택해야함
///     - 선택한 수의 범위에 대한 최대값 갱신 : dp
///     - dp[i] = max(array[i] + dp[i-1], array[i])
/// 2. 자료구조
///     - dp [Int]
///     - array [Int]
///     - rs Int
/// 3. 시간복잡도
///     - O(N^2)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    let array = readLine()!.split(separator: " ").map { Int($0)! }
    
    var dp = Array(repeating: Int.min, count: n+1)
    dp[0] = 0
    
    var rs = Int.min
    
    for i in 1...n {
        dp[i] = max(array[i-1], array[i-1] + dp[i-1])
        rs = max(rs, dp[i])
    }
    
    print(rs)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
