//
//  BOJ-11057
//  백준 11057번 - 오르막 수
//
//  Created by 손지영 on 2026/02/14
//  난이도: 실버1 | 소요시간: 33분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/11057
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 수의 자리가 오름차순을 이루는 수: 오르막수
///     - 인접한수가 같아도 오르막수임
///     - 0~9의 배열에서 중복은 허락하지만, 수가 같거나 증가해야하는 조합
///     - 중복은 허용하지만 이전값과 비교했을 때 같거나 커야 선택가능함
///     - DFS로 했더니 시간 초과남 -> 수를 줄여야함 -> DP로 변경
///     - DP 1차원말고 2차원으로해서 조합을 탐색함
///     1. dp[i][j]의 정의
///         - i 선택하는 자릿수, 마지막 수가 j인 오르막 수의 개수
///     2. dp[i][j]의 진행방향
///         - i : 2...n
///         - j : 0...9
///         - k : 0...9
///         => j를 선택했을 때 이전에 선택했어야하는 수 k
///         for i in 2...n
///             for j in 0...9
///                 for k in 0...j
///                     dp[i][j] = [지금자릿수][마지막으로 선택한 수] + [이전자릿수][이전에 선택 가능했던 모든 수 0~j] % 10_007
///     3. dp[i][j]의 점화식
///         dp[i][j] = dp[i][j] + dp[i-1][k] % 10_007
///     4. dp[i][j]의 초기값
///         - 자리수 1를 만드는 경우는 항상 1개임
///         - dp[1][0...9] = 1
/// 2. 자료구조
///     - s: [Int]
///     - temp: [Int]
///     - rs: Int
///     =====
///     dp [[Int]]
/// 3. 시간복잡도
///     - O(N*10*10)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var dp = Array(repeating: Array(repeating: 0, count: 10), count: n + 1)
    
    for j in 0...9 { dp[1][j] = 1 }
    
    if n > 1 {
        for i in 2...n {
            for j in 0...9 {
                for k in 0...j {
                    dp[i][j] = (dp[i][j] + dp[i-1][k]) % 10_007
                }
            }
        }
    }
    
    print(dp[n].reduce(0) { $0 + $1 } % 10_007)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
