//
//  BOJ-15651
//  백준 15651번 - N과 M (3)
//
//  Created by 손지영 on 2026/02/16
//  난이도: 실버3 | 소요시간: 7분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/15651
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 같은수를 여러번 골라도 되는 수열
///     - 수열은 오름차순으로 출력
/// 2. 자료구조
///     - temp [Int]
///     - array [Int]
/// 3. 시간복잡도
///     - O(N^2)
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let input = readLine()!.split(separator: " ").map { Int($0)! }
    let n = input[0]; let target = input[1]
    
    var rs = ""
    var temp = [Int]()

    func dfs() {
        if temp.count == target {
            rs += temp.map { String($0) }.joined(separator: " ")
            rs += "\n"
            return
        }

        for i in 1...n {
            temp.append(i)
            dfs()
            temp.removeLast()
        }
    }

    dfs()

    print(rs)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
