//
//  BOJ-1699
//  백준 1699번 - 제곱수의 합
//
//  Created by 손지영 on 2026/02/14
//  난이도: 실버2 | 소요시간: 30분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1699
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 제곱수들의 합. 항의 최소개수
///     - DP?
///     - dp[0] = 0, dp[1] = 1, dp[2] = 2, dp[3] = 3 -> dp[i] = i
///     for i in 1...n
///         for j in 1...Int(sqrt(Double(i)))
///             dp[i] = min(dp[i], dp[i - j*j] + 1)
///     - 합이 i가 되려면, 어떤 제곱수를(j*j)를 마지막에 선택했고, 그 이전값이 i-j*j 이어야함.
/// 2. 자료구조
///     - dp [Int]
/// 3. 시간복잡도
///     - O(N^(3/2))
///         : 3/2?
///             -> 1 + 1/2 = N^(1/2) == N√N
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let n = Int(readLine()!)!
    
    var dp = Array(repeating: 0, count: n + 1)
    
    for i in 1...n {
        dp[i] = i
    }
    
    if n > 1 {
        for i in 1...n {
            for j in 1...Int(sqrt(Double(i))) {
                dp[i] = min(dp[i], dp[i - j*j] + 1)
            }
        }
    }
    
    print(dp[n])
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
