//
//  BOJ-1107
//  백준 1107번 - 리모컨
//
//  Created by 손지영 on 2026/02/16
//  난이도: 골드4 | 소요시간: 51분 | 상태: ✅
//  링크: https://www.acmicpc.net/problem/1107
//

import Foundation

// ============================================
// 💡 핵심 아이디어
// ============================================
/// 1. 핵심아이디어
///     - 방문 불가능한 채널이 있음
///     - N 채널을 방문하기 위한 최소 횟수
///     - 지금 보고있는 채널: 100
///     - chanel Array(0...9)
///     - 고장난 버튼은 true로 변경
///     - 버튼클릭, + 클릭, - 클릭 한 경우 모두 탐색 필요
///     - 현재 채널이 0이 아닌경우 -1 가능, 현재 채널이 500_000 보다 작을 경우 +1 가능
///     - 채널을 조금 더 크게 잡고 확인. -로 내려오는게 더 클 수 있기 때문에 두배수로 우선 확인
///     - rs = target - 100 : 입력애야하는 최소 수
///     - 입력한 채널의 모든 자리수를 리모콘에서 선택할 수 있으면 true, 그렇지 않으면 false로 확인해서 누를수 있는 모든 채널을 탐색
/// 2. 자료구조
///     - chanel [Bool]
///     - rs Int
/// 3. 시간복잡도
///     - O(2N*자릿수) = 6*1e6
// ============================================
// 📌 주의사항
// ============================================

// ============================================
// 🔨 구현
// ============================================

func solution() {
    let target = Int(readLine()!)!
    let m = Int(readLine()!)!
    
    var c = [Int]()
    
    if m > 0 {
        c = readLine()!.split(separator: " ").map { Int($0)! }
    }
    
    let chanel = Array(0...9).map {
        c.contains($0)
    }
    
    var rs = abs(target - 100)
    
    for ch in 0...1_000_000 {
        if find(ch, chanel) {
            let p = String(ch).count
            rs = min(rs, p + abs(target - ch))
        }
    }
    
    func find(_ x: Int, _ broken: [Bool]) -> Bool {
        if x == 0 { return !broken[0] }
        var v = x
        while v > 0 {
            let d = v % 10
            if broken[d] { return false }
            v /= 10
        }
        return true
    }
    
    print(rs)
}

solution()

// ============================================
// ❓ 헷갈린점
// ============================================
